Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xc10 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x783c6): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x89568): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x5f3ad): /home/lth/src/blackpill/freertos1/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0xb23c): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x3f336): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 8

 <1><79>: Abbrev Number: 4 (DW_TAG_typedef)
    <7a>   DW_AT_name        : (indirect string, offset: 0x551bc): __int32_t
    <7e>   DW_AT_decl_file   : 2
    <7f>   DW_AT_decl_line   : 77
    <80>   DW_AT_decl_column : 24
    <81>   DW_AT_type        : <0x85>
 <1><85>: Abbrev Number: 3 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : (indirect string, offset: 0xb7a5): long int
 <1><8c>: Abbrev Number: 4 (DW_TAG_typedef)
    <8d>   DW_AT_name        : (indirect string, offset: 0x58337): __uint32_t
    <91>   DW_AT_decl_file   : 2
    <92>   DW_AT_decl_line   : 79
    <93>   DW_AT_decl_column : 25
    <94>   DW_AT_type        : <0x98>
 <1><98>: Abbrev Number: 3 (DW_TAG_base_type)
    <99>   DW_AT_byte_size   : 4
    <9a>   DW_AT_encoding    : 7	(unsigned)
    <9b>   DW_AT_name        : (indirect string, offset: 0x2aafb): long unsigned int
 <1><9f>: Abbrev Number: 3 (DW_TAG_base_type)
    <a0>   DW_AT_byte_size   : 8
    <a1>   DW_AT_encoding    : 7	(unsigned)
    <a2>   DW_AT_name        : (indirect string, offset: 0x1d1f8): long long unsigned int
 <1><a6>: Abbrev Number: 4 (DW_TAG_typedef)
    <a7>   DW_AT_name        : (indirect string, offset: 0x28194): uint8_t
    <ab>   DW_AT_decl_file   : 3
    <ac>   DW_AT_decl_line   : 24
    <ad>   DW_AT_decl_column : 19
    <ae>   DW_AT_type        : <0x4c>
 <1><b2>: Abbrev Number: 5 (DW_TAG_const_type)
    <b3>   DW_AT_type        : <0xa6>
 <1><b7>: Abbrev Number: 4 (DW_TAG_typedef)
    <b8>   DW_AT_name        : (indirect string, offset: 0x653dc): uint16_t
    <bc>   DW_AT_decl_file   : 3
    <bd>   DW_AT_decl_line   : 36
    <be>   DW_AT_decl_column : 20
    <bf>   DW_AT_type        : <0x66>
 <1><c3>: Abbrev Number: 4 (DW_TAG_typedef)
    <c4>   DW_AT_name        : (indirect string, offset: 0x551be): int32_t
    <c8>   DW_AT_decl_file   : 3
    <c9>   DW_AT_decl_line   : 44
    <ca>   DW_AT_decl_column : 19
    <cb>   DW_AT_type        : <0x79>
 <1><cf>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <d0>   DW_AT_type        : <0xc3>
 <1><d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d5>   DW_AT_name        : (indirect string, offset: 0x64ca6): uint32_t
    <d9>   DW_AT_decl_file   : 3
    <da>   DW_AT_decl_line   : 48
    <db>   DW_AT_decl_column : 20
    <dc>   DW_AT_type        : <0x8c>
 <1><e0>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <e1>   DW_AT_type        : <0xd4>
 <1><e5>: Abbrev Number: 7 (DW_TAG_variable)
    <e6>   DW_AT_name        : (indirect string, offset: 0x409a): SystemCoreClock
    <ea>   DW_AT_decl_file   : 9
    <eb>   DW_AT_decl_line   : 53
    <ec>   DW_AT_decl_column : 19
    <ed>   DW_AT_type        : <0xd4>
    <f1>   DW_AT_external    : 1
    <f1>   DW_AT_declaration : 1
 <1><f1>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <f2>   DW_AT_byte_size   : 4
 <1><f3>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4>   DW_AT_name        : (indirect string, offset: 0x65749): StackType_t
    <f8>   DW_AT_decl_file   : 4
    <f9>   DW_AT_decl_line   : 55
    <fa>   DW_AT_decl_column : 24
    <fb>   DW_AT_type        : <0xd4>
 <1><ff>: Abbrev Number: 4 (DW_TAG_typedef)
    <100>   DW_AT_name        : (indirect string, offset: 0x7fff1): UBaseType_t
    <104>   DW_AT_decl_file   : 4
    <105>   DW_AT_decl_line   : 57
    <106>   DW_AT_decl_column : 23
    <107>   DW_AT_type        : <0x98>
 <1><10b>: Abbrev Number: 4 (DW_TAG_typedef)
    <10c>   DW_AT_name        : (indirect string, offset: 0x4ce54): TickType_t
    <110>   DW_AT_decl_file   : 4
    <111>   DW_AT_decl_line   : 63
    <112>   DW_AT_decl_column : 19
    <113>   DW_AT_type        : <0xd4>
 <1><117>: Abbrev Number: 9 (DW_TAG_typedef)
    <118>   DW_AT_name        : (indirect string, offset: 0x66442): wint_t
    <11c>   DW_AT_decl_file   : 5
    <11d>   DW_AT_decl_line   : 350
    <11f>   DW_AT_decl_column : 23
    <120>   DW_AT_type        : <0x30>
 <1><124>: Abbrev Number: 4 (DW_TAG_typedef)
    <125>   DW_AT_name        : (indirect string, offset: 0x92a52): _off_t
    <129>   DW_AT_decl_file   : 6
    <12a>   DW_AT_decl_line   : 46
    <12b>   DW_AT_decl_column : 14
    <12c>   DW_AT_type        : <0x85>
 <1><130>: Abbrev Number: 4 (DW_TAG_typedef)
    <131>   DW_AT_name        : (indirect string, offset: 0x1f117): _fpos_t
    <135>   DW_AT_decl_file   : 6
    <136>   DW_AT_decl_line   : 116
    <137>   DW_AT_decl_column : 14
    <138>   DW_AT_type        : <0x85>
 <1><13c>: Abbrev Number: 10 (DW_TAG_union_type)
    <13d>   DW_AT_byte_size   : 4
    <13e>   DW_AT_decl_file   : 6
    <13f>   DW_AT_decl_line   : 165
    <140>   DW_AT_decl_column : 3
    <141>   DW_AT_sibling     : <0x15e>
 <2><145>: Abbrev Number: 11 (DW_TAG_member)
    <146>   DW_AT_name        : (indirect string, offset: 0x82fd6): __wch
    <14a>   DW_AT_decl_file   : 6
    <14b>   DW_AT_decl_line   : 167
    <14c>   DW_AT_decl_column : 12
    <14d>   DW_AT_type        : <0x117>
 <2><151>: Abbrev Number: 11 (DW_TAG_member)
    <152>   DW_AT_name        : (indirect string, offset: 0x479a5): __wchb
    <156>   DW_AT_decl_file   : 6
    <157>   DW_AT_decl_line   : 168
    <158>   DW_AT_decl_column : 19
    <159>   DW_AT_type        : <0x15e>
 <2><15d>: Abbrev Number: 0
 <1><15e>: Abbrev Number: 12 (DW_TAG_array_type)
    <15f>   DW_AT_type        : <0x58>
    <163>   DW_AT_sibling     : <0x16e>
 <2><167>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <168>   DW_AT_type        : <0x30>
    <16c>   DW_AT_upper_bound : 3
 <2><16d>: Abbrev Number: 0
 <1><16e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <16f>   DW_AT_byte_size   : 8
    <170>   DW_AT_decl_file   : 6
    <171>   DW_AT_decl_line   : 162
    <172>   DW_AT_decl_column : 9
    <173>   DW_AT_sibling     : <0x192>
 <2><177>: Abbrev Number: 15 (DW_TAG_member)
    <178>   DW_AT_name        : (indirect string, offset: 0x26f01): __count
    <17c>   DW_AT_decl_file   : 6
    <17d>   DW_AT_decl_line   : 164
    <17e>   DW_AT_decl_column : 7
    <17f>   DW_AT_type        : <0x29>
    <183>   DW_AT_data_member_location: 0
 <2><184>: Abbrev Number: 15 (DW_TAG_member)
    <185>   DW_AT_name        : (indirect string, offset: 0x4fe11): __value
    <189>   DW_AT_decl_file   : 6
    <18a>   DW_AT_decl_line   : 169
    <18b>   DW_AT_decl_column : 5
    <18c>   DW_AT_type        : <0x13c>
    <190>   DW_AT_data_member_location: 4
 <2><191>: Abbrev Number: 0
 <1><192>: Abbrev Number: 4 (DW_TAG_typedef)
    <193>   DW_AT_name        : (indirect string, offset: 0x48bf7): _mbstate_t
    <197>   DW_AT_decl_file   : 6
    <198>   DW_AT_decl_line   : 170
    <199>   DW_AT_decl_column : 3
    <19a>   DW_AT_type        : <0x16e>
 <1><19e>: Abbrev Number: 4 (DW_TAG_typedef)
    <19f>   DW_AT_name        : (indirect string, offset: 0x4b4d9): __ULong
    <1a3>   DW_AT_decl_file   : 7
    <1a4>   DW_AT_decl_line   : 22
    <1a5>   DW_AT_decl_column : 25
    <1a6>   DW_AT_type        : <0x98>
 <1><1aa>: Abbrev Number: 4 (DW_TAG_typedef)
    <1ab>   DW_AT_name        : (indirect string, offset: 0x4ca8e): _LOCK_T
    <1af>   DW_AT_decl_file   : 8
    <1b0>   DW_AT_decl_line   : 34
    <1b1>   DW_AT_decl_column : 25
    <1b2>   DW_AT_type        : <0x1b6>
 <1><1b6>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <1b7>   DW_AT_byte_size   : 4
    <1b8>   DW_AT_type        : <0x1bc>
 <1><1bc>: Abbrev Number: 17 (DW_TAG_structure_type)
    <1bd>   DW_AT_name        : (indirect string, offset: 0x2ad50): __lock
    <1c1>   DW_AT_declaration : 1
 <1><1c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <1c2>   DW_AT_name        : (indirect string, offset: 0x44976): _flock_t
    <1c6>   DW_AT_decl_file   : 7
    <1c7>   DW_AT_decl_line   : 35
    <1c8>   DW_AT_decl_column : 27
    <1c9>   DW_AT_type        : <0x1aa>
 <1><1cd>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1ce>   DW_AT_name        : (indirect string, offset: 0x303bd): _Bigint
    <1d2>   DW_AT_byte_size   : 24
    <1d3>   DW_AT_decl_file   : 7
    <1d4>   DW_AT_decl_line   : 52
    <1d5>   DW_AT_decl_column : 8
    <1d6>   DW_AT_sibling     : <0x227>
 <2><1da>: Abbrev Number: 15 (DW_TAG_member)
    <1db>   DW_AT_name        : (indirect string, offset: 0x52af5): _next
    <1df>   DW_AT_decl_file   : 7
    <1e0>   DW_AT_decl_line   : 54
    <1e1>   DW_AT_decl_column : 19
    <1e2>   DW_AT_type        : <0x227>
    <1e6>   DW_AT_data_member_location: 0
 <2><1e7>: Abbrev Number: 19 (DW_TAG_member)
    <1e8>   DW_AT_name        : _k
    <1eb>   DW_AT_decl_file   : 7
    <1ec>   DW_AT_decl_line   : 55
    <1ed>   DW_AT_decl_column : 7
    <1ee>   DW_AT_type        : <0x29>
    <1f2>   DW_AT_data_member_location: 4
 <2><1f3>: Abbrev Number: 15 (DW_TAG_member)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x6349a): _maxwds
    <1f8>   DW_AT_decl_file   : 7
    <1f9>   DW_AT_decl_line   : 55
    <1fa>   DW_AT_decl_column : 11
    <1fb>   DW_AT_type        : <0x29>
    <1ff>   DW_AT_data_member_location: 8
 <2><200>: Abbrev Number: 15 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0x49fd3): _sign
    <205>   DW_AT_decl_file   : 7
    <206>   DW_AT_decl_line   : 55
    <207>   DW_AT_decl_column : 20
    <208>   DW_AT_type        : <0x29>
    <20c>   DW_AT_data_member_location: 12
 <2><20d>: Abbrev Number: 15 (DW_TAG_member)
    <20e>   DW_AT_name        : (indirect string, offset: 0x49bc4): _wds
    <212>   DW_AT_decl_file   : 7
    <213>   DW_AT_decl_line   : 55
    <214>   DW_AT_decl_column : 27
    <215>   DW_AT_type        : <0x29>
    <219>   DW_AT_data_member_location: 16
 <2><21a>: Abbrev Number: 19 (DW_TAG_member)
    <21b>   DW_AT_name        : _x
    <21e>   DW_AT_decl_file   : 7
    <21f>   DW_AT_decl_line   : 56
    <220>   DW_AT_decl_column : 11
    <221>   DW_AT_type        : <0x22d>
    <225>   DW_AT_data_member_location: 20
 <2><226>: Abbrev Number: 0
 <1><227>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <228>   DW_AT_byte_size   : 4
    <229>   DW_AT_type        : <0x1cd>
 <1><22d>: Abbrev Number: 12 (DW_TAG_array_type)
    <22e>   DW_AT_type        : <0x19e>
    <232>   DW_AT_sibling     : <0x23d>
 <2><236>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <237>   DW_AT_type        : <0x30>
    <23b>   DW_AT_upper_bound : 0
 <2><23c>: Abbrev Number: 0
 <1><23d>: Abbrev Number: 18 (DW_TAG_structure_type)
    <23e>   DW_AT_name        : (indirect string, offset: 0x25de6): __tm
    <242>   DW_AT_byte_size   : 36
    <243>   DW_AT_decl_file   : 7
    <244>   DW_AT_decl_line   : 60
    <245>   DW_AT_decl_column : 8
    <246>   DW_AT_sibling     : <0x2c0>
 <2><24a>: Abbrev Number: 15 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0x71a2d): __tm_sec
    <24f>   DW_AT_decl_file   : 7
    <250>   DW_AT_decl_line   : 62
    <251>   DW_AT_decl_column : 9
    <252>   DW_AT_type        : <0x29>
    <256>   DW_AT_data_member_location: 0
 <2><257>: Abbrev Number: 15 (DW_TAG_member)
    <258>   DW_AT_name        : (indirect string, offset: 0xa17): __tm_min
    <25c>   DW_AT_decl_file   : 7
    <25d>   DW_AT_decl_line   : 63
    <25e>   DW_AT_decl_column : 9
    <25f>   DW_AT_type        : <0x29>
    <263>   DW_AT_data_member_location: 4
 <2><264>: Abbrev Number: 15 (DW_TAG_member)
    <265>   DW_AT_name        : (indirect string, offset: 0x1de30): __tm_hour
    <269>   DW_AT_decl_file   : 7
    <26a>   DW_AT_decl_line   : 64
    <26b>   DW_AT_decl_column : 9
    <26c>   DW_AT_type        : <0x29>
    <270>   DW_AT_data_member_location: 8
 <2><271>: Abbrev Number: 15 (DW_TAG_member)
    <272>   DW_AT_name        : (indirect string, offset: 0x51660): __tm_mday
    <276>   DW_AT_decl_file   : 7
    <277>   DW_AT_decl_line   : 65
    <278>   DW_AT_decl_column : 9
    <279>   DW_AT_type        : <0x29>
    <27d>   DW_AT_data_member_location: 12
 <2><27e>: Abbrev Number: 15 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0x250b): __tm_mon
    <283>   DW_AT_decl_file   : 7
    <284>   DW_AT_decl_line   : 66
    <285>   DW_AT_decl_column : 9
    <286>   DW_AT_type        : <0x29>
    <28a>   DW_AT_data_member_location: 16
 <2><28b>: Abbrev Number: 15 (DW_TAG_member)
    <28c>   DW_AT_name        : (indirect string, offset: 0x8152c): __tm_year
    <290>   DW_AT_decl_file   : 7
    <291>   DW_AT_decl_line   : 67
    <292>   DW_AT_decl_column : 9
    <293>   DW_AT_type        : <0x29>
    <297>   DW_AT_data_member_location: 20
 <2><298>: Abbrev Number: 15 (DW_TAG_member)
    <299>   DW_AT_name        : (indirect string, offset: 0x3a252): __tm_wday
    <29d>   DW_AT_decl_file   : 7
    <29e>   DW_AT_decl_line   : 68
    <29f>   DW_AT_decl_column : 9
    <2a0>   DW_AT_type        : <0x29>
    <2a4>   DW_AT_data_member_location: 24
 <2><2a5>: Abbrev Number: 15 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x6df14): __tm_yday
    <2aa>   DW_AT_decl_file   : 7
    <2ab>   DW_AT_decl_line   : 69
    <2ac>   DW_AT_decl_column : 9
    <2ad>   DW_AT_type        : <0x29>
    <2b1>   DW_AT_data_member_location: 28
 <2><2b2>: Abbrev Number: 15 (DW_TAG_member)
    <2b3>   DW_AT_name        : (indirect string, offset: 0x7d0aa): __tm_isdst
    <2b7>   DW_AT_decl_file   : 7
    <2b8>   DW_AT_decl_line   : 70
    <2b9>   DW_AT_decl_column : 9
    <2ba>   DW_AT_type        : <0x29>
    <2be>   DW_AT_data_member_location: 32
 <2><2bf>: Abbrev Number: 0
 <1><2c0>: Abbrev Number: 20 (DW_TAG_structure_type)
    <2c1>   DW_AT_name        : (indirect string, offset: 0x520cc): _on_exit_args
    <2c5>   DW_AT_byte_size   : 264
    <2c7>   DW_AT_decl_file   : 7
    <2c8>   DW_AT_decl_line   : 79
    <2c9>   DW_AT_decl_column : 8
    <2ca>   DW_AT_sibling     : <0x305>
 <2><2ce>: Abbrev Number: 15 (DW_TAG_member)
    <2cf>   DW_AT_name        : (indirect string, offset: 0x7bb03): _fnargs
    <2d3>   DW_AT_decl_file   : 7
    <2d4>   DW_AT_decl_line   : 80
    <2d5>   DW_AT_decl_column : 10
    <2d6>   DW_AT_type        : <0x305>
    <2da>   DW_AT_data_member_location: 0
 <2><2db>: Abbrev Number: 15 (DW_TAG_member)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x73eba): _dso_handle
    <2e0>   DW_AT_decl_file   : 7
    <2e1>   DW_AT_decl_line   : 81
    <2e2>   DW_AT_decl_column : 9
    <2e3>   DW_AT_type        : <0x305>
    <2e7>   DW_AT_data_member_location: 128
 <2><2e8>: Abbrev Number: 21 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x60b7c): _fntypes
    <2ed>   DW_AT_decl_file   : 7
    <2ee>   DW_AT_decl_line   : 83
    <2ef>   DW_AT_decl_column : 10
    <2f0>   DW_AT_type        : <0x19e>
    <2f4>   DW_AT_data_member_location: 256
 <2><2f6>: Abbrev Number: 21 (DW_TAG_member)
    <2f7>   DW_AT_name        : (indirect string, offset: 0x38d4f): _is_cxa
    <2fb>   DW_AT_decl_file   : 7
    <2fc>   DW_AT_decl_line   : 86
    <2fd>   DW_AT_decl_column : 10
    <2fe>   DW_AT_type        : <0x19e>
    <302>   DW_AT_data_member_location: 260
 <2><304>: Abbrev Number: 0
 <1><305>: Abbrev Number: 12 (DW_TAG_array_type)
    <306>   DW_AT_type        : <0xf1>
    <30a>   DW_AT_sibling     : <0x315>
 <2><30e>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <30f>   DW_AT_type        : <0x30>
    <313>   DW_AT_upper_bound : 31
 <2><314>: Abbrev Number: 0
 <1><315>: Abbrev Number: 18 (DW_TAG_structure_type)
    <316>   DW_AT_name        : (indirect string, offset: 0x2746): _atexit
    <31a>   DW_AT_byte_size   : 140
    <31b>   DW_AT_decl_file   : 7
    <31c>   DW_AT_decl_line   : 90
    <31d>   DW_AT_decl_column : 8
    <31e>   DW_AT_sibling     : <0x357>
 <2><322>: Abbrev Number: 15 (DW_TAG_member)
    <323>   DW_AT_name        : (indirect string, offset: 0x52af5): _next
    <327>   DW_AT_decl_file   : 7
    <328>   DW_AT_decl_line   : 91
    <329>   DW_AT_decl_column : 18
    <32a>   DW_AT_type        : <0x357>
    <32e>   DW_AT_data_member_location: 0
 <2><32f>: Abbrev Number: 15 (DW_TAG_member)
    <330>   DW_AT_name        : (indirect string, offset: 0x57ce4): _ind
    <334>   DW_AT_decl_file   : 7
    <335>   DW_AT_decl_line   : 92
    <336>   DW_AT_decl_column : 6
    <337>   DW_AT_type        : <0x29>
    <33b>   DW_AT_data_member_location: 4
 <2><33c>: Abbrev Number: 15 (DW_TAG_member)
    <33d>   DW_AT_name        : (indirect string, offset: 0x1eeb1): _fns
    <341>   DW_AT_decl_file   : 7
    <342>   DW_AT_decl_line   : 93
    <343>   DW_AT_decl_column : 9
    <344>   DW_AT_type        : <0x35d>
    <348>   DW_AT_data_member_location: 8
 <2><349>: Abbrev Number: 15 (DW_TAG_member)
    <34a>   DW_AT_name        : (indirect string, offset: 0x6fbb5): _on_exit_args_ptr
    <34e>   DW_AT_decl_file   : 7
    <34f>   DW_AT_decl_line   : 94
    <350>   DW_AT_decl_column : 32
    <351>   DW_AT_type        : <0x374>
    <355>   DW_AT_data_member_location: 136
 <2><356>: Abbrev Number: 0
 <1><357>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <358>   DW_AT_byte_size   : 4
    <359>   DW_AT_type        : <0x315>
 <1><35d>: Abbrev Number: 12 (DW_TAG_array_type)
    <35e>   DW_AT_type        : <0x36d>
    <362>   DW_AT_sibling     : <0x36d>
 <2><366>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <367>   DW_AT_type        : <0x30>
    <36b>   DW_AT_upper_bound : 31
 <2><36c>: Abbrev Number: 0
 <1><36d>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <36e>   DW_AT_byte_size   : 4
    <36f>   DW_AT_type        : <0x373>
 <1><373>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <374>   DW_AT_prototyped  : 1
 <1><374>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <375>   DW_AT_byte_size   : 4
    <376>   DW_AT_type        : <0x2c0>
 <1><37a>: Abbrev Number: 18 (DW_TAG_structure_type)
    <37b>   DW_AT_name        : (indirect string, offset: 0x5c65b): __sbuf
    <37f>   DW_AT_byte_size   : 8
    <380>   DW_AT_decl_file   : 7
    <381>   DW_AT_decl_line   : 122
    <382>   DW_AT_decl_column : 8
    <383>   DW_AT_sibling     : <0x3a2>
 <2><387>: Abbrev Number: 15 (DW_TAG_member)
    <388>   DW_AT_name        : (indirect string, offset: 0x8a22d): _base
    <38c>   DW_AT_decl_file   : 7
    <38d>   DW_AT_decl_line   : 123
    <38e>   DW_AT_decl_column : 17
    <38f>   DW_AT_type        : <0x3a2>
    <393>   DW_AT_data_member_location: 0
 <2><394>: Abbrev Number: 15 (DW_TAG_member)
    <395>   DW_AT_name        : (indirect string, offset: 0x925d4): _size
    <399>   DW_AT_decl_file   : 7
    <39a>   DW_AT_decl_line   : 124
    <39b>   DW_AT_decl_column : 6
    <39c>   DW_AT_type        : <0x29>
    <3a0>   DW_AT_data_member_location: 4
 <2><3a1>: Abbrev Number: 0
 <1><3a2>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <3a3>   DW_AT_byte_size   : 4
    <3a4>   DW_AT_type        : <0x58>
 <1><3a8>: Abbrev Number: 18 (DW_TAG_structure_type)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x3088e): __sFILE_fake
    <3ad>   DW_AT_byte_size   : 32
    <3ae>   DW_AT_decl_file   : 7
    <3af>   DW_AT_decl_line   : 158
    <3b0>   DW_AT_decl_column : 8
    <3b1>   DW_AT_sibling     : <0x41b>
 <2><3b5>: Abbrev Number: 19 (DW_TAG_member)
    <3b6>   DW_AT_name        : _p
    <3b9>   DW_AT_decl_file   : 7
    <3ba>   DW_AT_decl_line   : 159
    <3bb>   DW_AT_decl_column : 18
    <3bc>   DW_AT_type        : <0x3a2>
    <3c0>   DW_AT_data_member_location: 0
 <2><3c1>: Abbrev Number: 19 (DW_TAG_member)
    <3c2>   DW_AT_name        : _r
    <3c5>   DW_AT_decl_file   : 7
    <3c6>   DW_AT_decl_line   : 160
    <3c7>   DW_AT_decl_column : 7
    <3c8>   DW_AT_type        : <0x29>
    <3cc>   DW_AT_data_member_location: 4
 <2><3cd>: Abbrev Number: 19 (DW_TAG_member)
    <3ce>   DW_AT_name        : _w
    <3d1>   DW_AT_decl_file   : 7
    <3d2>   DW_AT_decl_line   : 161
    <3d3>   DW_AT_decl_column : 7
    <3d4>   DW_AT_type        : <0x29>
    <3d8>   DW_AT_data_member_location: 8
 <2><3d9>: Abbrev Number: 15 (DW_TAG_member)
    <3da>   DW_AT_name        : (indirect string, offset: 0x3f391): _flags
    <3de>   DW_AT_decl_file   : 7
    <3df>   DW_AT_decl_line   : 162
    <3e0>   DW_AT_decl_column : 9
    <3e1>   DW_AT_type        : <0x5f>
    <3e5>   DW_AT_data_member_location: 12
 <2><3e6>: Abbrev Number: 15 (DW_TAG_member)
    <3e7>   DW_AT_name        : (indirect string, offset: 0x1594f): _file
    <3eb>   DW_AT_decl_file   : 7
    <3ec>   DW_AT_decl_line   : 163
    <3ed>   DW_AT_decl_column : 9
    <3ee>   DW_AT_type        : <0x5f>
    <3f2>   DW_AT_data_member_location: 14
 <2><3f3>: Abbrev Number: 19 (DW_TAG_member)
    <3f4>   DW_AT_name        : _bf
    <3f8>   DW_AT_decl_file   : 7
    <3f9>   DW_AT_decl_line   : 164
    <3fa>   DW_AT_decl_column : 17
    <3fb>   DW_AT_type        : <0x37a>
    <3ff>   DW_AT_data_member_location: 16
 <2><400>: Abbrev Number: 15 (DW_TAG_member)
    <401>   DW_AT_name        : (indirect string, offset: 0x3f987): _lbfsize
    <405>   DW_AT_decl_file   : 7
    <406>   DW_AT_decl_line   : 165
    <407>   DW_AT_decl_column : 7
    <408>   DW_AT_type        : <0x29>
    <40c>   DW_AT_data_member_location: 24
 <2><40d>: Abbrev Number: 15 (DW_TAG_member)
    <40e>   DW_AT_name        : (indirect string, offset: 0x6170c): _data
    <412>   DW_AT_decl_file   : 7
    <413>   DW_AT_decl_line   : 167
    <414>   DW_AT_decl_column : 18
    <415>   DW_AT_type        : <0x563>
    <419>   DW_AT_data_member_location: 28
 <2><41a>: Abbrev Number: 0
 <1><41b>: Abbrev Number: 5 (DW_TAG_const_type)
    <41c>   DW_AT_type        : <0x3a8>
 <1><420>: Abbrev Number: 23 (DW_TAG_structure_type)
    <421>   DW_AT_name        : (indirect string, offset: 0x98d53): _reent
    <425>   DW_AT_byte_size   : 96
    <426>   DW_AT_decl_file   : 7
    <427>   DW_AT_decl_line   : 377
    <429>   DW_AT_decl_column : 8
    <42a>   DW_AT_sibling     : <0x563>
 <2><42e>: Abbrev Number: 24 (DW_TAG_member)
    <42f>   DW_AT_name        : (indirect string, offset: 0x5185c): _errno
    <433>   DW_AT_decl_file   : 7
    <434>   DW_AT_decl_line   : 381
    <436>   DW_AT_decl_column : 7
    <437>   DW_AT_type        : <0x29>
    <43b>   DW_AT_data_member_location: 0
 <2><43c>: Abbrev Number: 24 (DW_TAG_member)
    <43d>   DW_AT_name        : (indirect string, offset: 0x4282e): _stdin
    <441>   DW_AT_decl_file   : 7
    <442>   DW_AT_decl_line   : 386
    <444>   DW_AT_decl_column : 11
    <445>   DW_AT_type        : <0x7bb>
    <449>   DW_AT_data_member_location: 4
 <2><44a>: Abbrev Number: 24 (DW_TAG_member)
    <44b>   DW_AT_name        : (indirect string, offset: 0x8a76b): _stdout
    <44f>   DW_AT_decl_file   : 7
    <450>   DW_AT_decl_line   : 386
    <452>   DW_AT_decl_column : 20
    <453>   DW_AT_type        : <0x7bb>
    <457>   DW_AT_data_member_location: 8
 <2><458>: Abbrev Number: 24 (DW_TAG_member)
    <459>   DW_AT_name        : (indirect string, offset: 0x89dd6): _stderr
    <45d>   DW_AT_decl_file   : 7
    <45e>   DW_AT_decl_line   : 386
    <460>   DW_AT_decl_column : 30
    <461>   DW_AT_type        : <0x7bb>
    <465>   DW_AT_data_member_location: 12
 <2><466>: Abbrev Number: 24 (DW_TAG_member)
    <467>   DW_AT_name        : (indirect string, offset: 0x57cdf): _inc
    <46b>   DW_AT_decl_file   : 7
    <46c>   DW_AT_decl_line   : 388
    <46e>   DW_AT_decl_column : 8
    <46f>   DW_AT_type        : <0x29>
    <473>   DW_AT_data_member_location: 16
 <2><474>: Abbrev Number: 24 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0x6db31): _emergency
    <479>   DW_AT_decl_file   : 7
    <47a>   DW_AT_decl_line   : 390
    <47c>   DW_AT_decl_column : 9
    <47d>   DW_AT_type        : <0x6cf>
    <481>   DW_AT_data_member_location: 20
 <2><482>: Abbrev Number: 24 (DW_TAG_member)
    <483>   DW_AT_name        : (indirect string, offset: 0x3bdb5): __sdidinit
    <487>   DW_AT_decl_file   : 7
    <488>   DW_AT_decl_line   : 392
    <48a>   DW_AT_decl_column : 7
    <48b>   DW_AT_type        : <0x29>
    <48f>   DW_AT_data_member_location: 24
 <2><490>: Abbrev Number: 24 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0xc2bb): _unspecified_locale_info
    <495>   DW_AT_decl_file   : 7
    <496>   DW_AT_decl_line   : 394
    <498>   DW_AT_decl_column : 7
    <499>   DW_AT_type        : <0x29>
    <49d>   DW_AT_data_member_location: 28
 <2><49e>: Abbrev Number: 24 (DW_TAG_member)
    <49f>   DW_AT_name        : (indirect string, offset: 0x7b3b5): _locale
    <4a3>   DW_AT_decl_file   : 7
    <4a4>   DW_AT_decl_line   : 395
    <4a6>   DW_AT_decl_column : 22
    <4a7>   DW_AT_type        : <0x923>
    <4ab>   DW_AT_data_member_location: 32
 <2><4ac>: Abbrev Number: 25 (DW_TAG_member)
    <4ad>   DW_AT_name        : _mp
    <4b1>   DW_AT_decl_file   : 7
    <4b2>   DW_AT_decl_line   : 397
    <4b4>   DW_AT_decl_column : 18
    <4b5>   DW_AT_type        : <0x929>
    <4b9>   DW_AT_data_member_location: 36
 <2><4ba>: Abbrev Number: 24 (DW_TAG_member)
    <4bb>   DW_AT_name        : (indirect string, offset: 0x160cb): __cleanup
    <4bf>   DW_AT_decl_file   : 7
    <4c0>   DW_AT_decl_line   : 399
    <4c2>   DW_AT_decl_column : 10
    <4c3>   DW_AT_type        : <0x93a>
    <4c7>   DW_AT_data_member_location: 40
 <2><4c8>: Abbrev Number: 24 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x9699): _gamma_signgam
    <4cd>   DW_AT_decl_file   : 7
    <4ce>   DW_AT_decl_line   : 401
    <4d0>   DW_AT_decl_column : 7
    <4d1>   DW_AT_type        : <0x29>
    <4d5>   DW_AT_data_member_location: 44
 <2><4d6>: Abbrev Number: 24 (DW_TAG_member)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x66119): _cvtlen
    <4db>   DW_AT_decl_file   : 7
    <4dc>   DW_AT_decl_line   : 404
    <4de>   DW_AT_decl_column : 7
    <4df>   DW_AT_type        : <0x29>
    <4e3>   DW_AT_data_member_location: 48
 <2><4e4>: Abbrev Number: 24 (DW_TAG_member)
    <4e5>   DW_AT_name        : (indirect string, offset: 0x401f1): _cvtbuf
    <4e9>   DW_AT_decl_file   : 7
    <4ea>   DW_AT_decl_line   : 405
    <4ec>   DW_AT_decl_column : 9
    <4ed>   DW_AT_type        : <0x6cf>
    <4f1>   DW_AT_data_member_location: 52
 <2><4f2>: Abbrev Number: 24 (DW_TAG_member)
    <4f3>   DW_AT_name        : (indirect string, offset: 0x67c7a): _r48
    <4f7>   DW_AT_decl_file   : 7
    <4f8>   DW_AT_decl_line   : 407
    <4fa>   DW_AT_decl_column : 19
    <4fb>   DW_AT_type        : <0x940>
    <4ff>   DW_AT_data_member_location: 56
 <2><500>: Abbrev Number: 24 (DW_TAG_member)
    <501>   DW_AT_name        : (indirect string, offset: 0x735b0): _localtime_buf
    <505>   DW_AT_decl_file   : 7
    <506>   DW_AT_decl_line   : 408
    <508>   DW_AT_decl_column : 16
    <509>   DW_AT_type        : <0x946>
    <50d>   DW_AT_data_member_location: 60
 <2><50e>: Abbrev Number: 24 (DW_TAG_member)
    <50f>   DW_AT_name        : (indirect string, offset: 0x20e08): _asctime_buf
    <513>   DW_AT_decl_file   : 7
    <514>   DW_AT_decl_line   : 409
    <516>   DW_AT_decl_column : 9
    <517>   DW_AT_type        : <0x6cf>
    <51b>   DW_AT_data_member_location: 64
 <2><51c>: Abbrev Number: 24 (DW_TAG_member)
    <51d>   DW_AT_name        : (indirect string, offset: 0x6dad): _sig_func
    <521>   DW_AT_decl_file   : 7
    <522>   DW_AT_decl_line   : 412
    <524>   DW_AT_decl_column : 12
    <525>   DW_AT_type        : <0x957>
    <529>   DW_AT_data_member_location: 68
 <2><52a>: Abbrev Number: 24 (DW_TAG_member)
    <52b>   DW_AT_name        : (indirect string, offset: 0x632a0): __sglue
    <52f>   DW_AT_decl_file   : 7
    <530>   DW_AT_decl_line   : 420
    <532>   DW_AT_decl_column : 16
    <533>   DW_AT_type        : <0x77c>
    <537>   DW_AT_data_member_location: 72
 <2><538>: Abbrev Number: 24 (DW_TAG_member)
    <539>   DW_AT_name        : (indirect string, offset: 0x257b7): __sf
    <53d>   DW_AT_decl_file   : 7
    <53e>   DW_AT_decl_line   : 421
    <540>   DW_AT_decl_column : 11
    <541>   DW_AT_type        : <0x7bb>
    <545>   DW_AT_data_member_location: 84
 <2><546>: Abbrev Number: 24 (DW_TAG_member)
    <547>   DW_AT_name        : (indirect string, offset: 0x3e82b): _misc
    <54b>   DW_AT_decl_file   : 7
    <54c>   DW_AT_decl_line   : 422
    <54e>   DW_AT_decl_column : 23
    <54f>   DW_AT_type        : <0x963>
    <553>   DW_AT_data_member_location: 88
 <2><554>: Abbrev Number: 24 (DW_TAG_member)
    <555>   DW_AT_name        : (indirect string, offset: 0x5645a): _signal_buf
    <559>   DW_AT_decl_file   : 7
    <55a>   DW_AT_decl_line   : 423
    <55c>   DW_AT_decl_column : 9
    <55d>   DW_AT_type        : <0x6cf>
    <561>   DW_AT_data_member_location: 92
 <2><562>: Abbrev Number: 0
 <1><563>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <564>   DW_AT_byte_size   : 4
    <565>   DW_AT_type        : <0x420>
 <1><569>: Abbrev Number: 5 (DW_TAG_const_type)
    <56a>   DW_AT_type        : <0x563>
 <1><56e>: Abbrev Number: 18 (DW_TAG_structure_type)
    <56f>   DW_AT_name        : (indirect string, offset: 0x6a5f4): __sFILE
    <573>   DW_AT_byte_size   : 104
    <574>   DW_AT_decl_file   : 7
    <575>   DW_AT_decl_line   : 186
    <576>   DW_AT_decl_column : 8
    <577>   DW_AT_sibling     : <0x6b1>
 <2><57b>: Abbrev Number: 19 (DW_TAG_member)
    <57c>   DW_AT_name        : _p
    <57f>   DW_AT_decl_file   : 7
    <580>   DW_AT_decl_line   : 187
    <581>   DW_AT_decl_column : 18
    <582>   DW_AT_type        : <0x3a2>
    <586>   DW_AT_data_member_location: 0
 <2><587>: Abbrev Number: 19 (DW_TAG_member)
    <588>   DW_AT_name        : _r
    <58b>   DW_AT_decl_file   : 7
    <58c>   DW_AT_decl_line   : 188
    <58d>   DW_AT_decl_column : 7
    <58e>   DW_AT_type        : <0x29>
    <592>   DW_AT_data_member_location: 4
 <2><593>: Abbrev Number: 19 (DW_TAG_member)
    <594>   DW_AT_name        : _w
    <597>   DW_AT_decl_file   : 7
    <598>   DW_AT_decl_line   : 189
    <599>   DW_AT_decl_column : 7
    <59a>   DW_AT_type        : <0x29>
    <59e>   DW_AT_data_member_location: 8
 <2><59f>: Abbrev Number: 15 (DW_TAG_member)
    <5a0>   DW_AT_name        : (indirect string, offset: 0x3f391): _flags
    <5a4>   DW_AT_decl_file   : 7
    <5a5>   DW_AT_decl_line   : 190
    <5a6>   DW_AT_decl_column : 9
    <5a7>   DW_AT_type        : <0x5f>
    <5ab>   DW_AT_data_member_location: 12
 <2><5ac>: Abbrev Number: 15 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x1594f): _file
    <5b1>   DW_AT_decl_file   : 7
    <5b2>   DW_AT_decl_line   : 191
    <5b3>   DW_AT_decl_column : 9
    <5b4>   DW_AT_type        : <0x5f>
    <5b8>   DW_AT_data_member_location: 14
 <2><5b9>: Abbrev Number: 19 (DW_TAG_member)
    <5ba>   DW_AT_name        : _bf
    <5be>   DW_AT_decl_file   : 7
    <5bf>   DW_AT_decl_line   : 192
    <5c0>   DW_AT_decl_column : 17
    <5c1>   DW_AT_type        : <0x37a>
    <5c5>   DW_AT_data_member_location: 16
 <2><5c6>: Abbrev Number: 15 (DW_TAG_member)
    <5c7>   DW_AT_name        : (indirect string, offset: 0x3f987): _lbfsize
    <5cb>   DW_AT_decl_file   : 7
    <5cc>   DW_AT_decl_line   : 193
    <5cd>   DW_AT_decl_column : 7
    <5ce>   DW_AT_type        : <0x29>
    <5d2>   DW_AT_data_member_location: 24
 <2><5d3>: Abbrev Number: 15 (DW_TAG_member)
    <5d4>   DW_AT_name        : (indirect string, offset: 0x6170c): _data
    <5d8>   DW_AT_decl_file   : 7
    <5d9>   DW_AT_decl_line   : 196
    <5da>   DW_AT_decl_column : 18
    <5db>   DW_AT_type        : <0x563>
    <5df>   DW_AT_data_member_location: 28
 <2><5e0>: Abbrev Number: 15 (DW_TAG_member)
    <5e1>   DW_AT_name        : (indirect string, offset: 0x7bea2): _cookie
    <5e5>   DW_AT_decl_file   : 7
    <5e6>   DW_AT_decl_line   : 200
    <5e7>   DW_AT_decl_column : 10
    <5e8>   DW_AT_type        : <0xf1>
    <5ec>   DW_AT_data_member_location: 32
 <2><5ed>: Abbrev Number: 15 (DW_TAG_member)
    <5ee>   DW_AT_name        : (indirect string, offset: 0x6d950): _read
    <5f2>   DW_AT_decl_file   : 7
    <5f3>   DW_AT_decl_line   : 202
    <5f4>   DW_AT_decl_column : 29
    <5f5>   DW_AT_type        : <0x6e1>
    <5f9>   DW_AT_data_member_location: 36
 <2><5fa>: Abbrev Number: 15 (DW_TAG_member)
    <5fb>   DW_AT_name        : (indirect string, offset: 0x11643): _write
    <5ff>   DW_AT_decl_file   : 7
    <600>   DW_AT_decl_line   : 204
    <601>   DW_AT_decl_column : 29
    <602>   DW_AT_type        : <0x70b>
    <606>   DW_AT_data_member_location: 40
 <2><607>: Abbrev Number: 15 (DW_TAG_member)
    <608>   DW_AT_name        : (indirect string, offset: 0x88a3a): _seek
    <60c>   DW_AT_decl_file   : 7
    <60d>   DW_AT_decl_line   : 207
    <60e>   DW_AT_decl_column : 13
    <60f>   DW_AT_type        : <0x72f>
    <613>   DW_AT_data_member_location: 44
 <2><614>: Abbrev Number: 15 (DW_TAG_member)
    <615>   DW_AT_name        : (indirect string, offset: 0x3cb61): _close
    <619>   DW_AT_decl_file   : 7
    <61a>   DW_AT_decl_line   : 208
    <61b>   DW_AT_decl_column : 9
    <61c>   DW_AT_type        : <0x749>
    <620>   DW_AT_data_member_location: 48
 <2><621>: Abbrev Number: 19 (DW_TAG_member)
    <622>   DW_AT_name        : _ub
    <626>   DW_AT_decl_file   : 7
    <627>   DW_AT_decl_line   : 211
    <628>   DW_AT_decl_column : 17
    <629>   DW_AT_type        : <0x37a>
    <62d>   DW_AT_data_member_location: 52
 <2><62e>: Abbrev Number: 19 (DW_TAG_member)
    <62f>   DW_AT_name        : _up
    <633>   DW_AT_decl_file   : 7
    <634>   DW_AT_decl_line   : 212
    <635>   DW_AT_decl_column : 18
    <636>   DW_AT_type        : <0x3a2>
    <63a>   DW_AT_data_member_location: 60
 <2><63b>: Abbrev Number: 19 (DW_TAG_member)
    <63c>   DW_AT_name        : _ur
    <640>   DW_AT_decl_file   : 7
    <641>   DW_AT_decl_line   : 213
    <642>   DW_AT_decl_column : 7
    <643>   DW_AT_type        : <0x29>
    <647>   DW_AT_data_member_location: 64
 <2><648>: Abbrev Number: 15 (DW_TAG_member)
    <649>   DW_AT_name        : (indirect string, offset: 0x25a15): _ubuf
    <64d>   DW_AT_decl_file   : 7
    <64e>   DW_AT_decl_line   : 216
    <64f>   DW_AT_decl_column : 17
    <650>   DW_AT_type        : <0x74f>
    <654>   DW_AT_data_member_location: 68
 <2><655>: Abbrev Number: 15 (DW_TAG_member)
    <656>   DW_AT_name        : (indirect string, offset: 0x5e290): _nbuf
    <65a>   DW_AT_decl_file   : 7
    <65b>   DW_AT_decl_line   : 217
    <65c>   DW_AT_decl_column : 17
    <65d>   DW_AT_type        : <0x75f>
    <661>   DW_AT_data_member_location: 71
 <2><662>: Abbrev Number: 19 (DW_TAG_member)
    <663>   DW_AT_name        : _lb
    <667>   DW_AT_decl_file   : 7
    <668>   DW_AT_decl_line   : 220
    <669>   DW_AT_decl_column : 17
    <66a>   DW_AT_type        : <0x37a>
    <66e>   DW_AT_data_member_location: 72
 <2><66f>: Abbrev Number: 15 (DW_TAG_member)
    <670>   DW_AT_name        : (indirect string, offset: 0x92293): _blksize
    <674>   DW_AT_decl_file   : 7
    <675>   DW_AT_decl_line   : 223
    <676>   DW_AT_decl_column : 7
    <677>   DW_AT_type        : <0x29>
    <67b>   DW_AT_data_member_location: 80
 <2><67c>: Abbrev Number: 15 (DW_TAG_member)
    <67d>   DW_AT_name        : (indirect string, offset: 0x2cad2): _offset
    <681>   DW_AT_decl_file   : 7
    <682>   DW_AT_decl_line   : 224
    <683>   DW_AT_decl_column : 10
    <684>   DW_AT_type        : <0x124>
    <688>   DW_AT_data_member_location: 84
 <2><689>: Abbrev Number: 15 (DW_TAG_member)
    <68a>   DW_AT_name        : (indirect string, offset: 0x2ad51): _lock
    <68e>   DW_AT_decl_file   : 7
    <68f>   DW_AT_decl_line   : 231
    <690>   DW_AT_decl_column : 12
    <691>   DW_AT_type        : <0x1c1>
    <695>   DW_AT_data_member_location: 88
 <2><696>: Abbrev Number: 15 (DW_TAG_member)
    <697>   DW_AT_name        : (indirect string, offset: 0xfd97): _mbstate
    <69b>   DW_AT_decl_file   : 7
    <69c>   DW_AT_decl_line   : 233
    <69d>   DW_AT_decl_column : 14
    <69e>   DW_AT_type        : <0x192>
    <6a2>   DW_AT_data_member_location: 92
 <2><6a3>: Abbrev Number: 15 (DW_TAG_member)
    <6a4>   DW_AT_name        : (indirect string, offset: 0x70d76): _flags2
    <6a8>   DW_AT_decl_file   : 7
    <6a9>   DW_AT_decl_line   : 234
    <6aa>   DW_AT_decl_column : 9
    <6ab>   DW_AT_type        : <0x29>
    <6af>   DW_AT_data_member_location: 100
 <2><6b0>: Abbrev Number: 0
 <1><6b1>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <6b2>   DW_AT_prototyped  : 1
    <6b2>   DW_AT_type        : <0x29>
    <6b6>   DW_AT_sibling     : <0x6cf>
 <2><6ba>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6bb>   DW_AT_type        : <0x563>
 <2><6bf>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6c0>   DW_AT_type        : <0xf1>
 <2><6c4>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6c5>   DW_AT_type        : <0x6cf>
 <2><6c9>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6ca>   DW_AT_type        : <0x29>
 <2><6ce>: Abbrev Number: 0
 <1><6cf>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <6d0>   DW_AT_byte_size   : 4
    <6d1>   DW_AT_type        : <0x6d5>
 <1><6d5>: Abbrev Number: 3 (DW_TAG_base_type)
    <6d6>   DW_AT_byte_size   : 1
    <6d7>   DW_AT_encoding    : 8	(unsigned char)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x2ce3b): char
 <1><6dc>: Abbrev Number: 5 (DW_TAG_const_type)
    <6dd>   DW_AT_type        : <0x6d5>
 <1><6e1>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <6e2>   DW_AT_byte_size   : 4
    <6e3>   DW_AT_type        : <0x6b1>
 <1><6e7>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <6e8>   DW_AT_prototyped  : 1
    <6e8>   DW_AT_type        : <0x29>
    <6ec>   DW_AT_sibling     : <0x705>
 <2><6f0>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6f1>   DW_AT_type        : <0x563>
 <2><6f5>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6f6>   DW_AT_type        : <0xf1>
 <2><6fa>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <6fb>   DW_AT_type        : <0x705>
 <2><6ff>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <700>   DW_AT_type        : <0x29>
 <2><704>: Abbrev Number: 0
 <1><705>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <706>   DW_AT_byte_size   : 4
    <707>   DW_AT_type        : <0x6dc>
 <1><70b>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <70c>   DW_AT_byte_size   : 4
    <70d>   DW_AT_type        : <0x6e7>
 <1><711>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <712>   DW_AT_prototyped  : 1
    <712>   DW_AT_type        : <0x130>
    <716>   DW_AT_sibling     : <0x72f>
 <2><71a>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <71b>   DW_AT_type        : <0x563>
 <2><71f>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <720>   DW_AT_type        : <0xf1>
 <2><724>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <725>   DW_AT_type        : <0x130>
 <2><729>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <72a>   DW_AT_type        : <0x29>
 <2><72e>: Abbrev Number: 0
 <1><72f>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <730>   DW_AT_byte_size   : 4
    <731>   DW_AT_type        : <0x711>
 <1><735>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <736>   DW_AT_prototyped  : 1
    <736>   DW_AT_type        : <0x29>
    <73a>   DW_AT_sibling     : <0x749>
 <2><73e>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <73f>   DW_AT_type        : <0x563>
 <2><743>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <744>   DW_AT_type        : <0xf1>
 <2><748>: Abbrev Number: 0
 <1><749>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <74a>   DW_AT_byte_size   : 4
    <74b>   DW_AT_type        : <0x735>
 <1><74f>: Abbrev Number: 12 (DW_TAG_array_type)
    <750>   DW_AT_type        : <0x58>
    <754>   DW_AT_sibling     : <0x75f>
 <2><758>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <759>   DW_AT_type        : <0x30>
    <75d>   DW_AT_upper_bound : 2
 <2><75e>: Abbrev Number: 0
 <1><75f>: Abbrev Number: 12 (DW_TAG_array_type)
    <760>   DW_AT_type        : <0x58>
    <764>   DW_AT_sibling     : <0x76f>
 <2><768>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <769>   DW_AT_type        : <0x30>
    <76d>   DW_AT_upper_bound : 0
 <2><76e>: Abbrev Number: 0
 <1><76f>: Abbrev Number: 9 (DW_TAG_typedef)
    <770>   DW_AT_name        : (indirect string, offset: 0x580f2): __FILE
    <774>   DW_AT_decl_file   : 7
    <775>   DW_AT_decl_line   : 292
    <777>   DW_AT_decl_column : 26
    <778>   DW_AT_type        : <0x56e>
 <1><77c>: Abbrev Number: 23 (DW_TAG_structure_type)
    <77d>   DW_AT_name        : (indirect string, offset: 0x6a817): _glue
    <781>   DW_AT_byte_size   : 12
    <782>   DW_AT_decl_file   : 7
    <783>   DW_AT_decl_line   : 296
    <785>   DW_AT_decl_column : 8
    <786>   DW_AT_sibling     : <0x7b5>
 <2><78a>: Abbrev Number: 24 (DW_TAG_member)
    <78b>   DW_AT_name        : (indirect string, offset: 0x52af5): _next
    <78f>   DW_AT_decl_file   : 7
    <790>   DW_AT_decl_line   : 298
    <792>   DW_AT_decl_column : 17
    <793>   DW_AT_type        : <0x7b5>
    <797>   DW_AT_data_member_location: 0
 <2><798>: Abbrev Number: 24 (DW_TAG_member)
    <799>   DW_AT_name        : (indirect string, offset: 0x33c10): _niobs
    <79d>   DW_AT_decl_file   : 7
    <79e>   DW_AT_decl_line   : 299
    <7a0>   DW_AT_decl_column : 7
    <7a1>   DW_AT_type        : <0x29>
    <7a5>   DW_AT_data_member_location: 4
 <2><7a6>: Abbrev Number: 24 (DW_TAG_member)
    <7a7>   DW_AT_name        : (indirect string, offset: 0x4644a): _iobs
    <7ab>   DW_AT_decl_file   : 7
    <7ac>   DW_AT_decl_line   : 300
    <7ae>   DW_AT_decl_column : 11
    <7af>   DW_AT_type        : <0x7bb>
    <7b3>   DW_AT_data_member_location: 8
 <2><7b4>: Abbrev Number: 0
 <1><7b5>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <7b6>   DW_AT_byte_size   : 4
    <7b7>   DW_AT_type        : <0x77c>
 <1><7bb>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <7bc>   DW_AT_byte_size   : 4
    <7bd>   DW_AT_type        : <0x76f>
 <1><7c1>: Abbrev Number: 23 (DW_TAG_structure_type)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x3011f): _rand48
    <7c6>   DW_AT_byte_size   : 24
    <7c7>   DW_AT_decl_file   : 7
    <7c8>   DW_AT_decl_line   : 324
    <7ca>   DW_AT_decl_column : 8
    <7cb>   DW_AT_sibling     : <0x808>
 <2><7cf>: Abbrev Number: 24 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0x28338): _seed
    <7d4>   DW_AT_decl_file   : 7
    <7d5>   DW_AT_decl_line   : 325
    <7d7>   DW_AT_decl_column : 18
    <7d8>   DW_AT_type        : <0x808>
    <7dc>   DW_AT_data_member_location: 0
 <2><7dd>: Abbrev Number: 24 (DW_TAG_member)
    <7de>   DW_AT_name        : (indirect string, offset: 0xb5c4): _mult
    <7e2>   DW_AT_decl_file   : 7
    <7e3>   DW_AT_decl_line   : 326
    <7e5>   DW_AT_decl_column : 18
    <7e6>   DW_AT_type        : <0x808>
    <7ea>   DW_AT_data_member_location: 6
 <2><7eb>: Abbrev Number: 24 (DW_TAG_member)
    <7ec>   DW_AT_name        : (indirect string, offset: 0x47a59): _add
    <7f0>   DW_AT_decl_file   : 7
    <7f1>   DW_AT_decl_line   : 327
    <7f3>   DW_AT_decl_column : 18
    <7f4>   DW_AT_type        : <0x72>
    <7f8>   DW_AT_data_member_location: 12
 <2><7f9>: Abbrev Number: 24 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0x52af0): _rand_next
    <7fe>   DW_AT_decl_file   : 7
    <7ff>   DW_AT_decl_line   : 330
    <801>   DW_AT_decl_column : 36
    <802>   DW_AT_type        : <0x9f>
    <806>   DW_AT_data_member_location: 16
 <2><807>: Abbrev Number: 0
 <1><808>: Abbrev Number: 12 (DW_TAG_array_type)
    <809>   DW_AT_type        : <0x72>
    <80d>   DW_AT_sibling     : <0x818>
 <2><811>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <812>   DW_AT_type        : <0x30>
    <816>   DW_AT_upper_bound : 2
 <2><817>: Abbrev Number: 0
 <1><818>: Abbrev Number: 23 (DW_TAG_structure_type)
    <819>   DW_AT_name        : (indirect string, offset: 0x69c0a): _mprec
    <81d>   DW_AT_byte_size   : 16
    <81e>   DW_AT_decl_file   : 7
    <81f>   DW_AT_decl_line   : 349
    <821>   DW_AT_decl_column : 8
    <822>   DW_AT_sibling     : <0x85f>
 <2><826>: Abbrev Number: 24 (DW_TAG_member)
    <827>   DW_AT_name        : (indirect string, offset: 0x8aaa1): _result
    <82b>   DW_AT_decl_file   : 7
    <82c>   DW_AT_decl_line   : 352
    <82e>   DW_AT_decl_column : 19
    <82f>   DW_AT_type        : <0x227>
    <833>   DW_AT_data_member_location: 0
 <2><834>: Abbrev Number: 24 (DW_TAG_member)
    <835>   DW_AT_name        : (indirect string, offset: 0x6e0c0): _result_k
    <839>   DW_AT_decl_file   : 7
    <83a>   DW_AT_decl_line   : 353
    <83c>   DW_AT_decl_column : 7
    <83d>   DW_AT_type        : <0x29>
    <841>   DW_AT_data_member_location: 4
 <2><842>: Abbrev Number: 24 (DW_TAG_member)
    <843>   DW_AT_name        : (indirect string, offset: 0x42302): _p5s
    <847>   DW_AT_decl_file   : 7
    <848>   DW_AT_decl_line   : 354
    <84a>   DW_AT_decl_column : 19
    <84b>   DW_AT_type        : <0x227>
    <84f>   DW_AT_data_member_location: 8
 <2><850>: Abbrev Number: 24 (DW_TAG_member)
    <851>   DW_AT_name        : (indirect string, offset: 0x5074c): _freelist
    <855>   DW_AT_decl_file   : 7
    <856>   DW_AT_decl_line   : 355
    <858>   DW_AT_decl_column : 20
    <859>   DW_AT_type        : <0x85f>
    <85d>   DW_AT_data_member_location: 12
 <2><85e>: Abbrev Number: 0
 <1><85f>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <860>   DW_AT_byte_size   : 4
    <861>   DW_AT_type        : <0x227>
 <1><865>: Abbrev Number: 23 (DW_TAG_structure_type)
    <866>   DW_AT_name        : (indirect string, offset: 0x422a6): _misc_reent
    <86a>   DW_AT_byte_size   : 80
    <86b>   DW_AT_decl_file   : 7
    <86c>   DW_AT_decl_line   : 359
    <86e>   DW_AT_decl_column : 8
    <86f>   DW_AT_sibling     : <0x90e>
 <2><873>: Abbrev Number: 24 (DW_TAG_member)
    <874>   DW_AT_name        : (indirect string, offset: 0x7f093): _strtok_last
    <878>   DW_AT_decl_file   : 7
    <879>   DW_AT_decl_line   : 362
    <87b>   DW_AT_decl_column : 9
    <87c>   DW_AT_type        : <0x6cf>
    <880>   DW_AT_data_member_location: 0
 <2><881>: Abbrev Number: 24 (DW_TAG_member)
    <882>   DW_AT_name        : (indirect string, offset: 0x3c47a): _mblen_state
    <886>   DW_AT_decl_file   : 7
    <887>   DW_AT_decl_line   : 363
    <889>   DW_AT_decl_column : 14
    <88a>   DW_AT_type        : <0x192>
    <88e>   DW_AT_data_member_location: 4
 <2><88f>: Abbrev Number: 24 (DW_TAG_member)
    <890>   DW_AT_name        : (indirect string, offset: 0x7f0c2): _wctomb_state
    <894>   DW_AT_decl_file   : 7
    <895>   DW_AT_decl_line   : 364
    <897>   DW_AT_decl_column : 14
    <898>   DW_AT_type        : <0x192>
    <89c>   DW_AT_data_member_location: 12
 <2><89d>: Abbrev Number: 24 (DW_TAG_member)
    <89e>   DW_AT_name        : (indirect string, offset: 0x763eb): _mbtowc_state
    <8a2>   DW_AT_decl_file   : 7
    <8a3>   DW_AT_decl_line   : 365
    <8a5>   DW_AT_decl_column : 14
    <8a6>   DW_AT_type        : <0x192>
    <8aa>   DW_AT_data_member_location: 20
 <2><8ab>: Abbrev Number: 24 (DW_TAG_member)
    <8ac>   DW_AT_name        : (indirect string, offset: 0x46886): _l64a_buf
    <8b0>   DW_AT_decl_file   : 7
    <8b1>   DW_AT_decl_line   : 366
    <8b3>   DW_AT_decl_column : 8
    <8b4>   DW_AT_type        : <0x90e>
    <8b8>   DW_AT_data_member_location: 28
 <2><8b9>: Abbrev Number: 24 (DW_TAG_member)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x7e375): _getdate_err
    <8be>   DW_AT_decl_file   : 7
    <8bf>   DW_AT_decl_line   : 367
    <8c1>   DW_AT_decl_column : 7
    <8c2>   DW_AT_type        : <0x29>
    <8c6>   DW_AT_data_member_location: 36
 <2><8c7>: Abbrev Number: 24 (DW_TAG_member)
    <8c8>   DW_AT_name        : (indirect string, offset: 0x43249): _mbrlen_state
    <8cc>   DW_AT_decl_file   : 7
    <8cd>   DW_AT_decl_line   : 368
    <8cf>   DW_AT_decl_column : 14
    <8d0>   DW_AT_type        : <0x192>
    <8d4>   DW_AT_data_member_location: 40
 <2><8d5>: Abbrev Number: 24 (DW_TAG_member)
    <8d6>   DW_AT_name        : (indirect string, offset: 0x1e97d): _mbrtowc_state
    <8da>   DW_AT_decl_file   : 7
    <8db>   DW_AT_decl_line   : 369
    <8dd>   DW_AT_decl_column : 14
    <8de>   DW_AT_type        : <0x192>
    <8e2>   DW_AT_data_member_location: 48
 <2><8e3>: Abbrev Number: 24 (DW_TAG_member)
    <8e4>   DW_AT_name        : (indirect string, offset: 0x5ba19): _mbsrtowcs_state
    <8e8>   DW_AT_decl_file   : 7
    <8e9>   DW_AT_decl_line   : 370
    <8eb>   DW_AT_decl_column : 14
    <8ec>   DW_AT_type        : <0x192>
    <8f0>   DW_AT_data_member_location: 56
 <2><8f1>: Abbrev Number: 24 (DW_TAG_member)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x2aa2f): _wcrtomb_state
    <8f6>   DW_AT_decl_file   : 7
    <8f7>   DW_AT_decl_line   : 371
    <8f9>   DW_AT_decl_column : 14
    <8fa>   DW_AT_type        : <0x192>
    <8fe>   DW_AT_data_member_location: 64
 <2><8ff>: Abbrev Number: 24 (DW_TAG_member)
    <900>   DW_AT_name        : (indirect string, offset: 0x4f437): _wcsrtombs_state
    <904>   DW_AT_decl_file   : 7
    <905>   DW_AT_decl_line   : 372
    <907>   DW_AT_decl_column : 14
    <908>   DW_AT_type        : <0x192>
    <90c>   DW_AT_data_member_location: 72
 <2><90d>: Abbrev Number: 0
 <1><90e>: Abbrev Number: 12 (DW_TAG_array_type)
    <90f>   DW_AT_type        : <0x6d5>
    <913>   DW_AT_sibling     : <0x91e>
 <2><917>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <918>   DW_AT_type        : <0x30>
    <91c>   DW_AT_upper_bound : 7
 <2><91d>: Abbrev Number: 0
 <1><91e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <91f>   DW_AT_name        : (indirect string, offset: 0x76dac): __locale_t
    <923>   DW_AT_declaration : 1
 <1><923>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <924>   DW_AT_byte_size   : 4
    <925>   DW_AT_type        : <0x91e>
 <1><929>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <92a>   DW_AT_byte_size   : 4
    <92b>   DW_AT_type        : <0x818>
 <1><92f>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <930>   DW_AT_prototyped  : 1
    <930>   DW_AT_sibling     : <0x93a>
 <2><934>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <935>   DW_AT_type        : <0x563>
 <2><939>: Abbrev Number: 0
 <1><93a>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <93b>   DW_AT_byte_size   : 4
    <93c>   DW_AT_type        : <0x92f>
 <1><940>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <941>   DW_AT_byte_size   : 4
    <942>   DW_AT_type        : <0x7c1>
 <1><946>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <947>   DW_AT_byte_size   : 4
    <948>   DW_AT_type        : <0x23d>
 <1><94c>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <94d>   DW_AT_prototyped  : 1
    <94d>   DW_AT_sibling     : <0x957>
 <2><951>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <952>   DW_AT_type        : <0x29>
 <2><956>: Abbrev Number: 0
 <1><957>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <958>   DW_AT_byte_size   : 4
    <959>   DW_AT_type        : <0x95d>
 <1><95d>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <95e>   DW_AT_byte_size   : 4
    <95f>   DW_AT_type        : <0x94c>
 <1><963>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <964>   DW_AT_byte_size   : 4
    <965>   DW_AT_type        : <0x865>
 <1><969>: Abbrev Number: 29 (DW_TAG_variable)
    <96a>   DW_AT_name        : (indirect string, offset: 0x42825): __sf_fake_stdin
    <96e>   DW_AT_decl_file   : 7
    <96f>   DW_AT_decl_line   : 463
    <971>   DW_AT_decl_column : 34
    <972>   DW_AT_type        : <0x41b>
    <976>   DW_AT_external    : 1
    <976>   DW_AT_declaration : 1
 <1><976>: Abbrev Number: 29 (DW_TAG_variable)
    <977>   DW_AT_name        : (indirect string, offset: 0x8a762): __sf_fake_stdout
    <97b>   DW_AT_decl_file   : 7
    <97c>   DW_AT_decl_line   : 464
    <97e>   DW_AT_decl_column : 34
    <97f>   DW_AT_type        : <0x41b>
    <983>   DW_AT_external    : 1
    <983>   DW_AT_declaration : 1
 <1><983>: Abbrev Number: 29 (DW_TAG_variable)
    <984>   DW_AT_name        : (indirect string, offset: 0x89dcd): __sf_fake_stderr
    <988>   DW_AT_decl_file   : 7
    <989>   DW_AT_decl_line   : 465
    <98b>   DW_AT_decl_column : 34
    <98c>   DW_AT_type        : <0x41b>
    <990>   DW_AT_external    : 1
    <990>   DW_AT_declaration : 1
 <1><990>: Abbrev Number: 29 (DW_TAG_variable)
    <991>   DW_AT_name        : (indirect string, offset: 0x20dda): _impure_ptr
    <995>   DW_AT_decl_file   : 7
    <996>   DW_AT_decl_line   : 819
    <998>   DW_AT_decl_column : 23
    <999>   DW_AT_type        : <0x563>
    <99d>   DW_AT_external    : 1
    <99d>   DW_AT_declaration : 1
 <1><99d>: Abbrev Number: 29 (DW_TAG_variable)
    <99e>   DW_AT_name        : (indirect string, offset: 0x2518d): _global_impure_ptr
    <9a2>   DW_AT_decl_file   : 7
    <9a3>   DW_AT_decl_line   : 820
    <9a5>   DW_AT_decl_column : 29
    <9a6>   DW_AT_type        : <0x569>
    <9aa>   DW_AT_external    : 1
    <9aa>   DW_AT_declaration : 1
 <1><9aa>: Abbrev Number: 29 (DW_TAG_variable)
    <9ab>   DW_AT_name        : (indirect string, offset: 0x273f): _global_atexit
    <9af>   DW_AT_decl_file   : 7
    <9b0>   DW_AT_decl_line   : 838
    <9b2>   DW_AT_decl_column : 24
    <9b3>   DW_AT_type        : <0x357>
    <9b7>   DW_AT_external    : 1
    <9b7>   DW_AT_declaration : 1
 <1><9b7>: Abbrev Number: 23 (DW_TAG_structure_type)
    <9b8>   DW_AT_name        : (indirect string, offset: 0x73f66): xSTATIC_LIST_ITEM
    <9bc>   DW_AT_byte_size   : 20
    <9bd>   DW_AT_decl_file   : 10
    <9be>   DW_AT_decl_line   : 1061
    <9c0>   DW_AT_decl_column : 8
    <9c1>   DW_AT_sibling     : <0x9e2>
 <2><9c5>: Abbrev Number: 24 (DW_TAG_member)
    <9c6>   DW_AT_name        : (indirect string, offset: 0x8c481): xDummy2
    <9ca>   DW_AT_decl_file   : 10
    <9cb>   DW_AT_decl_line   : 1066
    <9cd>   DW_AT_decl_column : 13
    <9ce>   DW_AT_type        : <0x10b>
    <9d2>   DW_AT_data_member_location: 0
 <2><9d3>: Abbrev Number: 24 (DW_TAG_member)
    <9d4>   DW_AT_name        : (indirect string, offset: 0x31c38): pvDummy3
    <9d8>   DW_AT_decl_file   : 10
    <9d9>   DW_AT_decl_line   : 1067
    <9db>   DW_AT_decl_column : 8
    <9dc>   DW_AT_type        : <0x9e2>
    <9e0>   DW_AT_data_member_location: 4
 <2><9e1>: Abbrev Number: 0
 <1><9e2>: Abbrev Number: 12 (DW_TAG_array_type)
    <9e3>   DW_AT_type        : <0xf1>
    <9e7>   DW_AT_sibling     : <0x9f2>
 <2><9eb>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <9ec>   DW_AT_type        : <0x30>
    <9f0>   DW_AT_upper_bound : 3
 <2><9f1>: Abbrev Number: 0
 <1><9f2>: Abbrev Number: 9 (DW_TAG_typedef)
    <9f3>   DW_AT_name        : (indirect string, offset: 0x31e75): StaticListItem_t
    <9f7>   DW_AT_decl_file   : 10
    <9f8>   DW_AT_decl_line   : 1072
    <9fa>   DW_AT_decl_column : 34
    <9fb>   DW_AT_type        : <0x9b7>
 <1><9ff>: Abbrev Number: 23 (DW_TAG_structure_type)
    <a00>   DW_AT_name        : (indirect string, offset: 0x4fca7): xSTATIC_TCB
    <a04>   DW_AT_byte_size   : 180
    <a05>   DW_AT_decl_file   : 10
    <a06>   DW_AT_decl_line   : 1112
    <a08>   DW_AT_decl_column : 16
    <a09>   DW_AT_sibling     : <0xa9a>
 <2><a0d>: Abbrev Number: 24 (DW_TAG_member)
    <a0e>   DW_AT_name        : (indirect string, offset: 0x1c92c): pxDummy1
    <a12>   DW_AT_decl_file   : 10
    <a13>   DW_AT_decl_line   : 1114
    <a15>   DW_AT_decl_column : 11
    <a16>   DW_AT_type        : <0xf1>
    <a1a>   DW_AT_data_member_location: 0
 <2><a1b>: Abbrev Number: 24 (DW_TAG_member)
    <a1c>   DW_AT_name        : (indirect string, offset: 0x1ae3a): xDummy3
    <a20>   DW_AT_decl_file   : 10
    <a21>   DW_AT_decl_line   : 1118
    <a23>   DW_AT_decl_column : 19
    <a24>   DW_AT_type        : <0xa9a>
    <a28>   DW_AT_data_member_location: 4
 <2><a29>: Abbrev Number: 24 (DW_TAG_member)
    <a2a>   DW_AT_name        : (indirect string, offset: 0x135f1): uxDummy5
    <a2e>   DW_AT_decl_file   : 10
    <a2f>   DW_AT_decl_line   : 1119
    <a31>   DW_AT_decl_column : 16
    <a32>   DW_AT_type        : <0xff>
    <a36>   DW_AT_data_member_location: 44
 <2><a37>: Abbrev Number: 24 (DW_TAG_member)
    <a38>   DW_AT_name        : (indirect string, offset: 0x1c94f): pxDummy6
    <a3c>   DW_AT_decl_file   : 10
    <a3d>   DW_AT_decl_line   : 1120
    <a3f>   DW_AT_decl_column : 11
    <a40>   DW_AT_type        : <0xf1>
    <a44>   DW_AT_data_member_location: 48
 <2><a45>: Abbrev Number: 24 (DW_TAG_member)
    <a46>   DW_AT_name        : (indirect string, offset: 0x30e92): ucDummy7
    <a4a>   DW_AT_decl_file   : 10
    <a4b>   DW_AT_decl_line   : 1121
    <a4d>   DW_AT_decl_column : 13
    <a4e>   DW_AT_type        : <0xaaa>
    <a52>   DW_AT_data_member_location: 52
 <2><a53>: Abbrev Number: 24 (DW_TAG_member)
    <a54>   DW_AT_name        : (indirect string, offset: 0x7d823): uxDummy12
    <a58>   DW_AT_decl_file   : 10
    <a59>   DW_AT_decl_line   : 1132
    <a5b>   DW_AT_decl_column : 16
    <a5c>   DW_AT_type        : <0xaba>
    <a60>   DW_AT_data_member_location: 68
 <2><a61>: Abbrev Number: 24 (DW_TAG_member)
    <a62>   DW_AT_name        : (indirect string, offset: 0x6ecbe): xDummy17
    <a66>   DW_AT_decl_file   : 10
    <a67>   DW_AT_decl_line   : 1144
    <a69>   DW_AT_decl_column : 17
    <a6a>   DW_AT_type        : <0x420>
    <a6e>   DW_AT_data_member_location: 76
 <2><a6f>: Abbrev Number: 24 (DW_TAG_member)
    <a70>   DW_AT_name        : (indirect string, offset: 0x14687): ulDummy18
    <a74>   DW_AT_decl_file   : 10
    <a75>   DW_AT_decl_line   : 1147
    <a77>   DW_AT_decl_column : 14
    <a78>   DW_AT_type        : <0xd4>
    <a7c>   DW_AT_data_member_location: 172
 <2><a7d>: Abbrev Number: 24 (DW_TAG_member)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x88b90): ucDummy19
    <a82>   DW_AT_decl_file   : 10
    <a83>   DW_AT_decl_line   : 1148
    <a85>   DW_AT_decl_column : 13
    <a86>   DW_AT_type        : <0xa6>
    <a8a>   DW_AT_data_member_location: 176
 <2><a8b>: Abbrev Number: 24 (DW_TAG_member)
    <a8c>   DW_AT_name        : (indirect string, offset: 0x7dba0): uxDummy20
    <a90>   DW_AT_decl_file   : 10
    <a91>   DW_AT_decl_line   : 1151
    <a93>   DW_AT_decl_column : 13
    <a94>   DW_AT_type        : <0xa6>
    <a98>   DW_AT_data_member_location: 177
 <2><a99>: Abbrev Number: 0
 <1><a9a>: Abbrev Number: 12 (DW_TAG_array_type)
    <a9b>   DW_AT_type        : <0x9f2>
    <a9f>   DW_AT_sibling     : <0xaaa>
 <2><aa3>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <aa4>   DW_AT_type        : <0x30>
    <aa8>   DW_AT_upper_bound : 1
 <2><aa9>: Abbrev Number: 0
 <1><aaa>: Abbrev Number: 12 (DW_TAG_array_type)
    <aab>   DW_AT_type        : <0xa6>
    <aaf>   DW_AT_sibling     : <0xaba>
 <2><ab3>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <ab4>   DW_AT_type        : <0x30>
    <ab8>   DW_AT_upper_bound : 15
 <2><ab9>: Abbrev Number: 0
 <1><aba>: Abbrev Number: 12 (DW_TAG_array_type)
    <abb>   DW_AT_type        : <0xff>
    <abf>   DW_AT_sibling     : <0xaca>
 <2><ac3>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <ac4>   DW_AT_type        : <0x30>
    <ac8>   DW_AT_upper_bound : 1
 <2><ac9>: Abbrev Number: 0
 <1><aca>: Abbrev Number: 9 (DW_TAG_typedef)
    <acb>   DW_AT_name        : (indirect string, offset: 0x44b81): StaticTask_t
    <acf>   DW_AT_decl_file   : 10
    <ad0>   DW_AT_decl_line   : 1160
    <ad2>   DW_AT_decl_column : 3
    <ad3>   DW_AT_type        : <0x9ff>
 <1><ad7>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <ad8>   DW_AT_byte_size   : 4
    <ad9>   DW_AT_type        : <0xf3>
 <1><add>: Abbrev Number: 29 (DW_TAG_variable)
    <ade>   DW_AT_name        : (indirect string, offset: 0x2e2c): ITM_RxBuffer
    <ae2>   DW_AT_decl_file   : 11
    <ae3>   DW_AT_decl_line   : 2052
    <ae5>   DW_AT_decl_column : 25
    <ae6>   DW_AT_type        : <0xcf>
    <aea>   DW_AT_external    : 1
    <aea>   DW_AT_declaration : 1
 <1><aea>: Abbrev Number: 12 (DW_TAG_array_type)
    <aeb>   DW_AT_type        : <0xb2>
    <aef>   DW_AT_sibling     : <0xafa>
 <2><af3>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <af4>   DW_AT_type        : <0x30>
    <af8>   DW_AT_upper_bound : 15
 <2><af9>: Abbrev Number: 0
 <1><afa>: Abbrev Number: 5 (DW_TAG_const_type)
    <afb>   DW_AT_type        : <0xaea>
 <1><aff>: Abbrev Number: 7 (DW_TAG_variable)
    <b00>   DW_AT_name        : (indirect string, offset: 0x7e345): AHBPrescTable
    <b04>   DW_AT_decl_file   : 12
    <b05>   DW_AT_decl_line   : 76
    <b06>   DW_AT_decl_column : 23
    <b07>   DW_AT_type        : <0xafa>
    <b0b>   DW_AT_external    : 1
    <b0b>   DW_AT_declaration : 1
 <1><b0b>: Abbrev Number: 12 (DW_TAG_array_type)
    <b0c>   DW_AT_type        : <0xb2>
    <b10>   DW_AT_sibling     : <0xb1b>
 <2><b14>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <b15>   DW_AT_type        : <0x30>
    <b19>   DW_AT_upper_bound : 7
 <2><b1a>: Abbrev Number: 0
 <1><b1b>: Abbrev Number: 5 (DW_TAG_const_type)
    <b1c>   DW_AT_type        : <0xb0b>
 <1><b20>: Abbrev Number: 7 (DW_TAG_variable)
    <b21>   DW_AT_name        : (indirect string, offset: 0x3076f): APBPrescTable
    <b25>   DW_AT_decl_file   : 12
    <b26>   DW_AT_decl_line   : 77
    <b27>   DW_AT_decl_column : 23
    <b28>   DW_AT_type        : <0xb1b>
    <b2c>   DW_AT_external    : 1
    <b2c>   DW_AT_declaration : 1
 <1><b2c>: Abbrev Number: 30 (DW_TAG_enumeration_type)
    <b2d>   DW_AT_encoding    : 7	(unsigned)
    <b2e>   DW_AT_byte_size   : 1
    <b2f>   DW_AT_type        : <0x58>
    <b33>   DW_AT_decl_file   : 13
    <b34>   DW_AT_decl_line   : 51
    <b35>   DW_AT_decl_column : 1
    <b36>   DW_AT_sibling     : <0xb53>
 <2><b3a>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b3b>   DW_AT_name        : (indirect string, offset: 0x6a9df): HAL_TICK_FREQ_10HZ
    <b3f>   DW_AT_const_value : 100
 <2><b40>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b41>   DW_AT_name        : (indirect string, offset: 0x331b4): HAL_TICK_FREQ_100HZ
    <b45>   DW_AT_const_value : 10
 <2><b46>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b47>   DW_AT_name        : (indirect string, offset: 0x40eb6): HAL_TICK_FREQ_1KHZ
    <b4b>   DW_AT_const_value : 1
 <2><b4c>: Abbrev Number: 31 (DW_TAG_enumerator)
    <b4d>   DW_AT_name        : (indirect string, offset: 0x31953): HAL_TICK_FREQ_DEFAULT
    <b51>   DW_AT_const_value : 1
 <2><b52>: Abbrev Number: 0
 <1><b53>: Abbrev Number: 4 (DW_TAG_typedef)
    <b54>   DW_AT_name        : (indirect string, offset: 0x6fa9c): HAL_TickFreqTypeDef
    <b58>   DW_AT_decl_file   : 13
    <b59>   DW_AT_decl_line   : 56
    <b5a>   DW_AT_decl_column : 3
    <b5b>   DW_AT_type        : <0xb2c>
 <1><b5f>: Abbrev Number: 7 (DW_TAG_variable)
    <b60>   DW_AT_name        : (indirect string, offset: 0x20440): uwTick
    <b64>   DW_AT_decl_file   : 13
    <b65>   DW_AT_decl_line   : 205
    <b66>   DW_AT_decl_column : 22
    <b67>   DW_AT_type        : <0xe0>
    <b6b>   DW_AT_external    : 1
    <b6b>   DW_AT_declaration : 1
 <1><b6b>: Abbrev Number: 7 (DW_TAG_variable)
    <b6c>   DW_AT_name        : (indirect string, offset: 0x58a0e): uwTickPrio
    <b70>   DW_AT_decl_file   : 13
    <b71>   DW_AT_decl_line   : 206
    <b72>   DW_AT_decl_column : 17
    <b73>   DW_AT_type        : <0xd4>
    <b77>   DW_AT_external    : 1
    <b77>   DW_AT_declaration : 1
 <1><b77>: Abbrev Number: 7 (DW_TAG_variable)
    <b78>   DW_AT_name        : (indirect string, offset: 0x82ebd): uwTickFreq
    <b7c>   DW_AT_decl_file   : 13
    <b7d>   DW_AT_decl_line   : 207
    <b7e>   DW_AT_decl_column : 28
    <b7f>   DW_AT_type        : <0xb53>
    <b83>   DW_AT_external    : 1
    <b83>   DW_AT_declaration : 1
 <1><b83>: Abbrev Number: 32 (DW_TAG_variable)
    <b84>   DW_AT_name        : (indirect string, offset: 0x49635): xIdleTaskTCBBuffer
    <b88>   DW_AT_decl_file   : 1
    <b89>   DW_AT_decl_line   : 60
    <b8a>   DW_AT_decl_column : 21
    <b8b>   DW_AT_type        : <0xaca>
    <b8f>   DW_AT_location    : 5 byte block: 3 4 2 0 20 	(DW_OP_addr: 20000204)
 <1><b95>: Abbrev Number: 12 (DW_TAG_array_type)
    <b96>   DW_AT_type        : <0xf3>
    <b9a>   DW_AT_sibling     : <0xba5>
 <2><b9e>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <b9f>   DW_AT_type        : <0x30>
    <ba3>   DW_AT_upper_bound : 127
 <2><ba4>: Abbrev Number: 0
 <1><ba5>: Abbrev Number: 32 (DW_TAG_variable)
    <ba6>   DW_AT_name        : (indirect string, offset: 0x33b52): xIdleStack
    <baa>   DW_AT_decl_file   : 1
    <bab>   DW_AT_decl_line   : 61
    <bac>   DW_AT_decl_column : 20
    <bad>   DW_AT_type        : <0xb95>
    <bb1>   DW_AT_location    : 5 byte block: 3 b8 2 0 20 	(DW_OP_addr: 200002b8)
 <1><bb7>: Abbrev Number: 33 (DW_TAG_subprogram)
    <bb8>   DW_AT_external    : 1
    <bb8>   DW_AT_name        : (indirect string, offset: 0xe64b): vApplicationGetIdleTaskMemory
    <bbc>   DW_AT_decl_file   : 1
    <bbd>   DW_AT_decl_line   : 63
    <bbe>   DW_AT_decl_column : 6
    <bbf>   DW_AT_prototyped  : 1
    <bbf>   DW_AT_low_pc      : 0x8000578
    <bc3>   DW_AT_high_pc     : 0x34
    <bc7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bc9>   DW_AT_GNU_all_call_sites: 1
    <bc9>   DW_AT_sibling     : <0xbfb>
 <2><bcd>: Abbrev Number: 34 (DW_TAG_formal_parameter)
    <bce>   DW_AT_name        : (indirect string, offset: 0x49633): ppxIdleTaskTCBBuffer
    <bd2>   DW_AT_decl_file   : 1
    <bd3>   DW_AT_decl_line   : 63
    <bd4>   DW_AT_decl_column : 52
    <bd5>   DW_AT_type        : <0xbfb>
    <bd9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><bdc>: Abbrev Number: 34 (DW_TAG_formal_parameter)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x509af): ppxIdleTaskStackBuffer
    <be1>   DW_AT_decl_file   : 1
    <be2>   DW_AT_decl_line   : 63
    <be3>   DW_AT_decl_column : 88
    <be4>   DW_AT_type        : <0xc07>
    <be8>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><beb>: Abbrev Number: 34 (DW_TAG_formal_parameter)
    <bec>   DW_AT_name        : (indirect string, offset: 0x556db): pulIdleTaskStackSize
    <bf0>   DW_AT_decl_file   : 1
    <bf1>   DW_AT_decl_line   : 63
    <bf2>   DW_AT_decl_column : 122
    <bf3>   DW_AT_type        : <0xc0d>
    <bf7>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><bfa>: Abbrev Number: 0
 <1><bfb>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <bfc>   DW_AT_byte_size   : 4
    <bfd>   DW_AT_type        : <0xc01>
 <1><c01>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <c02>   DW_AT_byte_size   : 4
    <c03>   DW_AT_type        : <0xaca>
 <1><c07>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <c08>   DW_AT_byte_size   : 4
    <c09>   DW_AT_type        : <0xad7>
 <1><c0d>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <c0e>   DW_AT_byte_size   : 4
    <c0f>   DW_AT_type        : <0xd4>
 <1><c13>: Abbrev Number: 0
  Compilation Unit @ offset 0xc14:
   Length:        0x2314 (32-bit)
   Version:       4
   Abbrev Offset: 0x1db
   Pointer Size:  4
 <0><c1f>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c20>   DW_AT_producer    : (indirect string, offset: 0x783c6): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <c24>   DW_AT_language    : 12	(ANSI C99)
    <c25>   DW_AT_name        : (indirect string, offset: 0x90fea): ../Core/Src/main.c
    <c29>   DW_AT_comp_dir    : (indirect string, offset: 0x5f3ad): /home/lth/src/blackpill/freertos1/Debug
    <c2d>   DW_AT_ranges      : 0x10
    <c31>   DW_AT_low_pc      : 0x0
    <c35>   DW_AT_stmt_list   : 0x90e
    <c39>   DW_AT_GNU_macros  : 0x15194
 <1><c3d>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <c3e>   DW_AT_encoding    : 5	(signed)
    <c3f>   DW_AT_byte_size   : 1
    <c40>   DW_AT_type        : <0xdd2>
    <c44>   DW_AT_decl_file   : 7
    <c45>   DW_AT_decl_line   : 67
    <c46>   DW_AT_decl_column : 1
    <c47>   DW_AT_sibling     : <0xdd2>
 <2><c4b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x90f7c): NonMaskableInt_IRQn
    <c50>   DW_AT_const_value : -14
 <2><c51>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c52>   DW_AT_name        : (indirect string, offset: 0x8f54c): MemoryManagement_IRQn
    <c56>   DW_AT_const_value : -12
 <2><c57>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c58>   DW_AT_name        : (indirect string, offset: 0x90263): BusFault_IRQn
    <c5c>   DW_AT_const_value : -11
 <2><c5d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c5e>   DW_AT_name        : (indirect string, offset: 0x90f26): UsageFault_IRQn
    <c62>   DW_AT_const_value : -10
 <2><c63>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c64>   DW_AT_name        : (indirect string, offset: 0x8d6b5): SVCall_IRQn
    <c68>   DW_AT_const_value : -5
 <2><c69>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c6a>   DW_AT_name        : (indirect string, offset: 0x8e51c): DebugMonitor_IRQn
    <c6e>   DW_AT_const_value : -4
 <2><c6f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c70>   DW_AT_name        : (indirect string, offset: 0x8ea57): PendSV_IRQn
    <c74>   DW_AT_const_value : -2
 <2><c75>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c76>   DW_AT_name        : (indirect string, offset: 0x9068f): SysTick_IRQn
    <c7a>   DW_AT_const_value : -1
 <2><c7b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c7c>   DW_AT_name        : (indirect string, offset: 0x8f90d): WWDG_IRQn
    <c80>   DW_AT_const_value : 0
 <2><c81>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c82>   DW_AT_name        : (indirect string, offset: 0x8c558): PVD_IRQn
    <c86>   DW_AT_const_value : 1
 <2><c87>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c88>   DW_AT_name        : (indirect string, offset: 0x91737): TAMP_STAMP_IRQn
    <c8c>   DW_AT_const_value : 2
 <2><c8d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c8e>   DW_AT_name        : (indirect string, offset: 0x8ef78): RTC_WKUP_IRQn
    <c92>   DW_AT_const_value : 3
 <2><c93>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c94>   DW_AT_name        : (indirect string, offset: 0x8ccab): FLASH_IRQn
    <c98>   DW_AT_const_value : 4
 <2><c99>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c9a>   DW_AT_name        : (indirect string, offset: 0x9022b): RCC_IRQn
    <c9e>   DW_AT_const_value : 5
 <2><c9f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ca0>   DW_AT_name        : (indirect string, offset: 0x34187): EXTI0_IRQn
    <ca4>   DW_AT_const_value : 6
 <2><ca5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ca6>   DW_AT_name        : (indirect string, offset: 0x917cd): EXTI1_IRQn
    <caa>   DW_AT_const_value : 7
 <2><cab>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cac>   DW_AT_name        : (indirect string, offset: 0x8e137): EXTI2_IRQn
    <cb0>   DW_AT_const_value : 8
 <2><cb1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cb2>   DW_AT_name        : (indirect string, offset: 0x90756): EXTI3_IRQn
    <cb6>   DW_AT_const_value : 9
 <2><cb7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cb8>   DW_AT_name        : (indirect string, offset: 0x8d0cc): EXTI4_IRQn
    <cbc>   DW_AT_const_value : 10
 <2><cbd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cbe>   DW_AT_name        : (indirect string, offset: 0x8f8e8): DMA1_Stream0_IRQn
    <cc2>   DW_AT_const_value : 11
 <2><cc3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cc4>   DW_AT_name        : (indirect string, offset: 0x91a4f): DMA1_Stream1_IRQn
    <cc8>   DW_AT_const_value : 12
 <2><cc9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cca>   DW_AT_name        : (indirect string, offset: 0x8dfee): DMA1_Stream2_IRQn
    <cce>   DW_AT_const_value : 13
 <2><ccf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd0>   DW_AT_name        : (indirect string, offset: 0x8d452): DMA1_Stream3_IRQn
    <cd4>   DW_AT_const_value : 14
 <2><cd5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd6>   DW_AT_name        : (indirect string, offset: 0x8d412): DMA1_Stream4_IRQn
    <cda>   DW_AT_const_value : 15
 <2><cdb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cdc>   DW_AT_name        : (indirect string, offset: 0x8fef2): DMA1_Stream5_IRQn
    <ce0>   DW_AT_const_value : 16
 <2><ce1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ce2>   DW_AT_name        : (indirect string, offset: 0x8c933): DMA1_Stream6_IRQn
    <ce6>   DW_AT_const_value : 17
 <2><ce7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ce8>   DW_AT_name        : (indirect string, offset: 0x8e5d6): ADC_IRQn
    <cec>   DW_AT_const_value : 18
 <2><ced>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cee>   DW_AT_name        : (indirect string, offset: 0x8bc45): EXTI9_5_IRQn
    <cf2>   DW_AT_const_value : 23
 <2><cf3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cf4>   DW_AT_name        : (indirect string, offset: 0x8dc93): TIM1_BRK_TIM9_IRQn
    <cf8>   DW_AT_const_value : 24
 <2><cf9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cfa>   DW_AT_name        : (indirect string, offset: 0x8ee2b): TIM1_UP_TIM10_IRQn
    <cfe>   DW_AT_const_value : 25
 <2><cff>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d00>   DW_AT_name        : (indirect string, offset: 0x8fc18): TIM1_TRG_COM_TIM11_IRQn
    <d04>   DW_AT_const_value : 26
 <2><d05>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d06>   DW_AT_name        : (indirect string, offset: 0x8d64d): TIM1_CC_IRQn
    <d0a>   DW_AT_const_value : 27
 <2><d0b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x8c1e8): TIM2_IRQn
    <d10>   DW_AT_const_value : 28
 <2><d11>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d12>   DW_AT_name        : (indirect string, offset: 0x91280): TIM3_IRQn
    <d16>   DW_AT_const_value : 29
 <2><d17>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d18>   DW_AT_name        : (indirect string, offset: 0x8d73e): TIM4_IRQn
    <d1c>   DW_AT_const_value : 30
 <2><d1d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d1e>   DW_AT_name        : (indirect string, offset: 0x8d77d): I2C1_EV_IRQn
    <d22>   DW_AT_const_value : 31
 <2><d23>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d24>   DW_AT_name        : (indirect string, offset: 0x8f36c): I2C1_ER_IRQn
    <d28>   DW_AT_const_value : 32
 <2><d29>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d2a>   DW_AT_name        : (indirect string, offset: 0x8c1c8): I2C2_EV_IRQn
    <d2e>   DW_AT_const_value : 33
 <2><d2f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d30>   DW_AT_name        : (indirect string, offset: 0x8db01): I2C2_ER_IRQn
    <d34>   DW_AT_const_value : 34
 <2><d35>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d36>   DW_AT_name        : (indirect string, offset: 0x8c1d5): SPI1_IRQn
    <d3a>   DW_AT_const_value : 35
 <2><d3b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d3c>   DW_AT_name        : (indirect string, offset: 0x8ed41): SPI2_IRQn
    <d40>   DW_AT_const_value : 36
 <2><d41>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d42>   DW_AT_name        : (indirect string, offset: 0x902dd): USART1_IRQn
    <d46>   DW_AT_const_value : 37
 <2><d47>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d48>   DW_AT_name        : (indirect string, offset: 0x8ce63): USART2_IRQn
    <d4c>   DW_AT_const_value : 38
 <2><d4d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d4e>   DW_AT_name        : (indirect string, offset: 0x9098d): EXTI15_10_IRQn
    <d52>   DW_AT_const_value : 40
 <2><d53>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d54>   DW_AT_name        : (indirect string, offset: 0x909f6): RTC_Alarm_IRQn
    <d58>   DW_AT_const_value : 41
 <2><d59>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d5a>   DW_AT_name        : (indirect string, offset: 0x8cc9a): OTG_FS_WKUP_IRQn
    <d5e>   DW_AT_const_value : 42
 <2><d5f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d60>   DW_AT_name        : (indirect string, offset: 0x8f104): DMA1_Stream7_IRQn
    <d64>   DW_AT_const_value : 47
 <2><d65>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d66>   DW_AT_name        : (indirect string, offset: 0x2f3b5): SDIO_IRQn
    <d6a>   DW_AT_const_value : 49
 <2><d6b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d6c>   DW_AT_name        : (indirect string, offset: 0x8e00a): TIM5_IRQn
    <d70>   DW_AT_const_value : 50
 <2><d71>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d72>   DW_AT_name        : (indirect string, offset: 0x91a6b): SPI3_IRQn
    <d76>   DW_AT_const_value : 51
 <2><d77>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d78>   DW_AT_name        : (indirect string, offset: 0x8f78a): DMA2_Stream0_IRQn
    <d7c>   DW_AT_const_value : 56
 <2><d7d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d7e>   DW_AT_name        : (indirect string, offset: 0x8c21b): DMA2_Stream1_IRQn
    <d82>   DW_AT_const_value : 57
 <2><d83>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d84>   DW_AT_name        : (indirect string, offset: 0x8e7f9): DMA2_Stream2_IRQn
    <d88>   DW_AT_const_value : 58
 <2><d89>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d8a>   DW_AT_name        : (indirect string, offset: 0x91a75): DMA2_Stream3_IRQn
    <d8e>   DW_AT_const_value : 59
 <2><d8f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d90>   DW_AT_name        : (indirect string, offset: 0x8e024): DMA2_Stream4_IRQn
    <d94>   DW_AT_const_value : 60
 <2><d95>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d96>   DW_AT_name        : (indirect string, offset: 0x8edbf): OTG_FS_IRQn
    <d9a>   DW_AT_const_value : 67
 <2><d9b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d9c>   DW_AT_name        : (indirect string, offset: 0x90a05): DMA2_Stream5_IRQn
    <da0>   DW_AT_const_value : 68
 <2><da1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <da2>   DW_AT_name        : (indirect string, offset: 0x8d430): DMA2_Stream6_IRQn
    <da6>   DW_AT_const_value : 69
 <2><da7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <da8>   DW_AT_name        : (indirect string, offset: 0x8ff23): DMA2_Stream7_IRQn
    <dac>   DW_AT_const_value : 70
 <2><dad>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dae>   DW_AT_name        : (indirect string, offset: 0x8db97): USART6_IRQn
    <db2>   DW_AT_const_value : 71
 <2><db3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <db4>   DW_AT_name        : (indirect string, offset: 0x90ffd): I2C3_EV_IRQn
    <db8>   DW_AT_const_value : 72
 <2><db9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dba>   DW_AT_name        : (indirect string, offset: 0x8c69a): I2C3_ER_IRQn
    <dbe>   DW_AT_const_value : 73
 <2><dbf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc0>   DW_AT_name        : (indirect string, offset: 0x8bff7): FPU_IRQn
    <dc4>   DW_AT_const_value : 81
 <2><dc5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc6>   DW_AT_name        : (indirect string, offset: 0x8e000): SPI4_IRQn
    <dca>   DW_AT_const_value : 84
 <2><dcb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dcc>   DW_AT_name        : (indirect string, offset: 0x90eeb): SPI5_IRQn
    <dd0>   DW_AT_const_value : 85
 <2><dd1>: Abbrev Number: 0
 <1><dd2>: Abbrev Number: 5 (DW_TAG_base_type)
    <dd3>   DW_AT_byte_size   : 1
    <dd4>   DW_AT_encoding    : 6	(signed char)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x45a3f): signed char
 <1><dd9>: Abbrev Number: 6 (DW_TAG_typedef)
    <dda>   DW_AT_name        : (indirect string, offset: 0x8bce8): __int8_t
    <dde>   DW_AT_decl_file   : 3
    <ddf>   DW_AT_decl_line   : 41
    <de0>   DW_AT_decl_column : 23
    <de1>   DW_AT_type        : <0xdd2>
 <1><de5>: Abbrev Number: 6 (DW_TAG_typedef)
    <de6>   DW_AT_name        : (indirect string, offset: 0x28192): __uint8_t
    <dea>   DW_AT_decl_file   : 3
    <deb>   DW_AT_decl_line   : 43
    <dec>   DW_AT_decl_column : 24
    <ded>   DW_AT_type        : <0xdf1>
 <1><df1>: Abbrev Number: 5 (DW_TAG_base_type)
    <df2>   DW_AT_byte_size   : 1
    <df3>   DW_AT_encoding    : 8	(unsigned char)
    <df4>   DW_AT_name        : (indirect string, offset: 0x1c91e): unsigned char
 <1><df8>: Abbrev Number: 5 (DW_TAG_base_type)
    <df9>   DW_AT_byte_size   : 2
    <dfa>   DW_AT_encoding    : 5	(signed)
    <dfb>   DW_AT_name        : (indirect string, offset: 0x6782d): short int
 <1><dff>: Abbrev Number: 6 (DW_TAG_typedef)
    <e00>   DW_AT_name        : (indirect string, offset: 0x71529): __uint16_t
    <e04>   DW_AT_decl_file   : 3
    <e05>   DW_AT_decl_line   : 57
    <e06>   DW_AT_decl_column : 25
    <e07>   DW_AT_type        : <0xe0b>
 <1><e0b>: Abbrev Number: 5 (DW_TAG_base_type)
    <e0c>   DW_AT_byte_size   : 2
    <e0d>   DW_AT_encoding    : 7	(unsigned)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x8530c): short unsigned int
 <1><e12>: Abbrev Number: 6 (DW_TAG_typedef)
    <e13>   DW_AT_name        : (indirect string, offset: 0x551bc): __int32_t
    <e17>   DW_AT_decl_file   : 3
    <e18>   DW_AT_decl_line   : 77
    <e19>   DW_AT_decl_column : 24
    <e1a>   DW_AT_type        : <0xe1e>
 <1><e1e>: Abbrev Number: 5 (DW_TAG_base_type)
    <e1f>   DW_AT_byte_size   : 4
    <e20>   DW_AT_encoding    : 5	(signed)
    <e21>   DW_AT_name        : (indirect string, offset: 0xb7a5): long int
 <1><e25>: Abbrev Number: 6 (DW_TAG_typedef)
    <e26>   DW_AT_name        : (indirect string, offset: 0x58337): __uint32_t
    <e2a>   DW_AT_decl_file   : 3
    <e2b>   DW_AT_decl_line   : 79
    <e2c>   DW_AT_decl_column : 25
    <e2d>   DW_AT_type        : <0xe31>
 <1><e31>: Abbrev Number: 5 (DW_TAG_base_type)
    <e32>   DW_AT_byte_size   : 4
    <e33>   DW_AT_encoding    : 7	(unsigned)
    <e34>   DW_AT_name        : (indirect string, offset: 0x2aafb): long unsigned int
 <1><e38>: Abbrev Number: 5 (DW_TAG_base_type)
    <e39>   DW_AT_byte_size   : 8
    <e3a>   DW_AT_encoding    : 5	(signed)
    <e3b>   DW_AT_name        : (indirect string, offset: 0x3f336): long long int
 <1><e3f>: Abbrev Number: 5 (DW_TAG_base_type)
    <e40>   DW_AT_byte_size   : 8
    <e41>   DW_AT_encoding    : 7	(unsigned)
    <e42>   DW_AT_name        : (indirect string, offset: 0x1d1f8): long long unsigned int
 <1><e46>: Abbrev Number: 7 (DW_TAG_base_type)
    <e47>   DW_AT_byte_size   : 4
    <e48>   DW_AT_encoding    : 5	(signed)
    <e49>   DW_AT_name        : int
 <1><e4d>: Abbrev Number: 5 (DW_TAG_base_type)
    <e4e>   DW_AT_byte_size   : 4
    <e4f>   DW_AT_encoding    : 7	(unsigned)
    <e50>   DW_AT_name        : (indirect string, offset: 0xb23c): unsigned int
 <1><e54>: Abbrev Number: 6 (DW_TAG_typedef)
    <e55>   DW_AT_name        : (indirect string, offset: 0x8bcea): int8_t
    <e59>   DW_AT_decl_file   : 4
    <e5a>   DW_AT_decl_line   : 20
    <e5b>   DW_AT_decl_column : 18
    <e5c>   DW_AT_type        : <0xdd9>
 <1><e60>: Abbrev Number: 6 (DW_TAG_typedef)
    <e61>   DW_AT_name        : (indirect string, offset: 0x28194): uint8_t
    <e65>   DW_AT_decl_file   : 4
    <e66>   DW_AT_decl_line   : 24
    <e67>   DW_AT_decl_column : 19
    <e68>   DW_AT_type        : <0xde5>
 <1><e6c>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <e6d>   DW_AT_type        : <0xe60>
 <1><e71>: Abbrev Number: 9 (DW_TAG_const_type)
    <e72>   DW_AT_type        : <0xe60>
 <1><e76>: Abbrev Number: 6 (DW_TAG_typedef)
    <e77>   DW_AT_name        : (indirect string, offset: 0x653dc): uint16_t
    <e7b>   DW_AT_decl_file   : 4
    <e7c>   DW_AT_decl_line   : 36
    <e7d>   DW_AT_decl_column : 20
    <e7e>   DW_AT_type        : <0xdff>
 <1><e82>: Abbrev Number: 6 (DW_TAG_typedef)
    <e83>   DW_AT_name        : (indirect string, offset: 0x551be): int32_t
    <e87>   DW_AT_decl_file   : 4
    <e88>   DW_AT_decl_line   : 44
    <e89>   DW_AT_decl_column : 19
    <e8a>   DW_AT_type        : <0xe12>
 <1><e8e>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <e8f>   DW_AT_type        : <0xe82>
 <1><e93>: Abbrev Number: 6 (DW_TAG_typedef)
    <e94>   DW_AT_name        : (indirect string, offset: 0x64ca6): uint32_t
    <e98>   DW_AT_decl_file   : 4
    <e99>   DW_AT_decl_line   : 48
    <e9a>   DW_AT_decl_column : 20
    <e9b>   DW_AT_type        : <0xe25>
 <1><e9f>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <ea0>   DW_AT_type        : <0xe93>
 <1><ea4>: Abbrev Number: 10 (DW_TAG_array_type)
    <ea5>   DW_AT_type        : <0xe93>
    <ea9>   DW_AT_sibling     : <0xeb4>
 <2><ead>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <eae>   DW_AT_type        : <0xe4d>
    <eb2>   DW_AT_upper_bound : 0
 <2><eb3>: Abbrev Number: 0
 <1><eb4>: Abbrev Number: 10 (DW_TAG_array_type)
    <eb5>   DW_AT_type        : <0xe93>
    <eb9>   DW_AT_sibling     : <0xec4>
 <2><ebd>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <ebe>   DW_AT_type        : <0xe4d>
    <ec2>   DW_AT_upper_bound : 1
 <2><ec3>: Abbrev Number: 0
 <1><ec4>: Abbrev Number: 12 (DW_TAG_variable)
    <ec5>   DW_AT_name        : (indirect string, offset: 0x2e2c): ITM_RxBuffer
    <ec9>   DW_AT_decl_file   : 5
    <eca>   DW_AT_decl_line   : 2052
    <ecc>   DW_AT_decl_column : 25
    <ecd>   DW_AT_type        : <0xe8e>
    <ed1>   DW_AT_external    : 1
    <ed1>   DW_AT_declaration : 1
 <1><ed1>: Abbrev Number: 13 (DW_TAG_variable)
    <ed2>   DW_AT_name        : (indirect string, offset: 0x409a): SystemCoreClock
    <ed6>   DW_AT_decl_file   : 6
    <ed7>   DW_AT_decl_line   : 74
    <ed8>   DW_AT_decl_column : 17
    <ed9>   DW_AT_type        : <0xe93>
    <edd>   DW_AT_external    : 1
    <edd>   DW_AT_declaration : 1
 <1><edd>: Abbrev Number: 10 (DW_TAG_array_type)
    <ede>   DW_AT_type        : <0xe71>
    <ee2>   DW_AT_sibling     : <0xeed>
 <2><ee6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <ee7>   DW_AT_type        : <0xe4d>
    <eeb>   DW_AT_upper_bound : 15
 <2><eec>: Abbrev Number: 0
 <1><eed>: Abbrev Number: 9 (DW_TAG_const_type)
    <eee>   DW_AT_type        : <0xedd>
 <1><ef2>: Abbrev Number: 13 (DW_TAG_variable)
    <ef3>   DW_AT_name        : (indirect string, offset: 0x7e345): AHBPrescTable
    <ef7>   DW_AT_decl_file   : 6
    <ef8>   DW_AT_decl_line   : 76
    <ef9>   DW_AT_decl_column : 23
    <efa>   DW_AT_type        : <0xeed>
    <efe>   DW_AT_external    : 1
    <efe>   DW_AT_declaration : 1
 <1><efe>: Abbrev Number: 10 (DW_TAG_array_type)
    <eff>   DW_AT_type        : <0xe71>
    <f03>   DW_AT_sibling     : <0xf0e>
 <2><f07>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <f08>   DW_AT_type        : <0xe4d>
    <f0c>   DW_AT_upper_bound : 7
 <2><f0d>: Abbrev Number: 0
 <1><f0e>: Abbrev Number: 9 (DW_TAG_const_type)
    <f0f>   DW_AT_type        : <0xefe>
 <1><f13>: Abbrev Number: 13 (DW_TAG_variable)
    <f14>   DW_AT_name        : (indirect string, offset: 0x3076f): APBPrescTable
    <f18>   DW_AT_decl_file   : 6
    <f19>   DW_AT_decl_line   : 77
    <f1a>   DW_AT_decl_column : 23
    <f1b>   DW_AT_type        : <0xf0e>
    <f1f>   DW_AT_external    : 1
    <f1f>   DW_AT_declaration : 1
 <1><f1f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <f20>   DW_AT_byte_size   : 24
    <f21>   DW_AT_decl_file   : 7
    <f22>   DW_AT_decl_line   : 215
    <f23>   DW_AT_decl_column : 9
    <f24>   DW_AT_sibling     : <0xf76>
 <2><f28>: Abbrev Number: 15 (DW_TAG_member)
    <f29>   DW_AT_name        : CR
    <f2c>   DW_AT_decl_file   : 7
    <f2d>   DW_AT_decl_line   : 217
    <f2e>   DW_AT_decl_column : 17
    <f2f>   DW_AT_type        : <0xe9f>
    <f33>   DW_AT_data_member_location: 0
 <2><f34>: Abbrev Number: 16 (DW_TAG_member)
    <f35>   DW_AT_name        : (indirect string, offset: 0x8e495): NDTR
    <f39>   DW_AT_decl_file   : 7
    <f3a>   DW_AT_decl_line   : 218
    <f3b>   DW_AT_decl_column : 17
    <f3c>   DW_AT_type        : <0xe9f>
    <f40>   DW_AT_data_member_location: 4
 <2><f41>: Abbrev Number: 15 (DW_TAG_member)
    <f42>   DW_AT_name        : PAR
    <f46>   DW_AT_decl_file   : 7
    <f47>   DW_AT_decl_line   : 219
    <f48>   DW_AT_decl_column : 17
    <f49>   DW_AT_type        : <0xe9f>
    <f4d>   DW_AT_data_member_location: 8
 <2><f4e>: Abbrev Number: 16 (DW_TAG_member)
    <f4f>   DW_AT_name        : (indirect string, offset: 0x8de4e): M0AR
    <f53>   DW_AT_decl_file   : 7
    <f54>   DW_AT_decl_line   : 220
    <f55>   DW_AT_decl_column : 17
    <f56>   DW_AT_type        : <0xe9f>
    <f5a>   DW_AT_data_member_location: 12
 <2><f5b>: Abbrev Number: 16 (DW_TAG_member)
    <f5c>   DW_AT_name        : (indirect string, offset: 0x8c0bc): M1AR
    <f60>   DW_AT_decl_file   : 7
    <f61>   DW_AT_decl_line   : 221
    <f62>   DW_AT_decl_column : 17
    <f63>   DW_AT_type        : <0xe9f>
    <f67>   DW_AT_data_member_location: 16
 <2><f68>: Abbrev Number: 15 (DW_TAG_member)
    <f69>   DW_AT_name        : FCR
    <f6d>   DW_AT_decl_file   : 7
    <f6e>   DW_AT_decl_line   : 222
    <f6f>   DW_AT_decl_column : 17
    <f70>   DW_AT_type        : <0xe9f>
    <f74>   DW_AT_data_member_location: 20
 <2><f75>: Abbrev Number: 0
 <1><f76>: Abbrev Number: 6 (DW_TAG_typedef)
    <f77>   DW_AT_name        : (indirect string, offset: 0x91179): DMA_Stream_TypeDef
    <f7b>   DW_AT_decl_file   : 7
    <f7c>   DW_AT_decl_line   : 223
    <f7d>   DW_AT_decl_column : 3
    <f7e>   DW_AT_type        : <0xf1f>
 <1><f82>: Abbrev Number: 17 (DW_TAG_structure_type)
    <f83>   DW_AT_byte_size   : 40
    <f84>   DW_AT_decl_file   : 7
    <f85>   DW_AT_decl_line   : 266
    <f87>   DW_AT_decl_column : 9
    <f88>   DW_AT_sibling     : <0x100b>
 <2><f8c>: Abbrev Number: 18 (DW_TAG_member)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x8b871): MODER
    <f91>   DW_AT_decl_file   : 7
    <f92>   DW_AT_decl_line   : 268
    <f94>   DW_AT_decl_column : 17
    <f95>   DW_AT_type        : <0xe9f>
    <f99>   DW_AT_data_member_location: 0
 <2><f9a>: Abbrev Number: 18 (DW_TAG_member)
    <f9b>   DW_AT_name        : (indirect string, offset: 0x90271): OTYPER
    <f9f>   DW_AT_decl_file   : 7
    <fa0>   DW_AT_decl_line   : 269
    <fa2>   DW_AT_decl_column : 17
    <fa3>   DW_AT_type        : <0xe9f>
    <fa7>   DW_AT_data_member_location: 4
 <2><fa8>: Abbrev Number: 18 (DW_TAG_member)
    <fa9>   DW_AT_name        : (indirect string, offset: 0x90cf6): OSPEEDR
    <fad>   DW_AT_decl_file   : 7
    <fae>   DW_AT_decl_line   : 270
    <fb0>   DW_AT_decl_column : 17
    <fb1>   DW_AT_type        : <0xe9f>
    <fb5>   DW_AT_data_member_location: 8
 <2><fb6>: Abbrev Number: 18 (DW_TAG_member)
    <fb7>   DW_AT_name        : (indirect string, offset: 0x8fda2): PUPDR
    <fbb>   DW_AT_decl_file   : 7
    <fbc>   DW_AT_decl_line   : 271
    <fbe>   DW_AT_decl_column : 17
    <fbf>   DW_AT_type        : <0xe9f>
    <fc3>   DW_AT_data_member_location: 12
 <2><fc4>: Abbrev Number: 19 (DW_TAG_member)
    <fc5>   DW_AT_name        : IDR
    <fc9>   DW_AT_decl_file   : 7
    <fca>   DW_AT_decl_line   : 272
    <fcc>   DW_AT_decl_column : 17
    <fcd>   DW_AT_type        : <0xe9f>
    <fd1>   DW_AT_data_member_location: 16
 <2><fd2>: Abbrev Number: 19 (DW_TAG_member)
    <fd3>   DW_AT_name        : ODR
    <fd7>   DW_AT_decl_file   : 7
    <fd8>   DW_AT_decl_line   : 273
    <fda>   DW_AT_decl_column : 17
    <fdb>   DW_AT_type        : <0xe9f>
    <fdf>   DW_AT_data_member_location: 20
 <2><fe0>: Abbrev Number: 18 (DW_TAG_member)
    <fe1>   DW_AT_name        : (indirect string, offset: 0x8cdb3): BSRR
    <fe5>   DW_AT_decl_file   : 7
    <fe6>   DW_AT_decl_line   : 274
    <fe8>   DW_AT_decl_column : 17
    <fe9>   DW_AT_type        : <0xe9f>
    <fed>   DW_AT_data_member_location: 24
 <2><fee>: Abbrev Number: 18 (DW_TAG_member)
    <fef>   DW_AT_name        : (indirect string, offset: 0x90bb6): LCKR
    <ff3>   DW_AT_decl_file   : 7
    <ff4>   DW_AT_decl_line   : 275
    <ff6>   DW_AT_decl_column : 17
    <ff7>   DW_AT_type        : <0xe9f>
    <ffb>   DW_AT_data_member_location: 28
 <2><ffc>: Abbrev Number: 19 (DW_TAG_member)
    <ffd>   DW_AT_name        : AFR
    <1001>   DW_AT_decl_file   : 7
    <1002>   DW_AT_decl_line   : 276
    <1004>   DW_AT_decl_column : 17
    <1005>   DW_AT_type        : <0x101b>
    <1009>   DW_AT_data_member_location: 32
 <2><100a>: Abbrev Number: 0
 <1><100b>: Abbrev Number: 10 (DW_TAG_array_type)
    <100c>   DW_AT_type        : <0xe9f>
    <1010>   DW_AT_sibling     : <0x101b>
 <2><1014>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1015>   DW_AT_type        : <0xe4d>
    <1019>   DW_AT_upper_bound : 1
 <2><101a>: Abbrev Number: 0
 <1><101b>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <101c>   DW_AT_type        : <0x100b>
 <1><1020>: Abbrev Number: 20 (DW_TAG_typedef)
    <1021>   DW_AT_name        : (indirect string, offset: 0x9192d): GPIO_TypeDef
    <1025>   DW_AT_decl_file   : 7
    <1026>   DW_AT_decl_line   : 277
    <1028>   DW_AT_decl_column : 3
    <1029>   DW_AT_type        : <0xf82>
 <1><102d>: Abbrev Number: 17 (DW_TAG_structure_type)
    <102e>   DW_AT_byte_size   : 8
    <102f>   DW_AT_decl_file   : 7
    <1030>   DW_AT_decl_line   : 327
    <1032>   DW_AT_decl_column : 9
    <1033>   DW_AT_sibling     : <0x1053>
 <2><1037>: Abbrev Number: 19 (DW_TAG_member)
    <1038>   DW_AT_name        : CR
    <103b>   DW_AT_decl_file   : 7
    <103c>   DW_AT_decl_line   : 329
    <103e>   DW_AT_decl_column : 17
    <103f>   DW_AT_type        : <0xe9f>
    <1043>   DW_AT_data_member_location: 0
 <2><1044>: Abbrev Number: 19 (DW_TAG_member)
    <1045>   DW_AT_name        : CSR
    <1049>   DW_AT_decl_file   : 7
    <104a>   DW_AT_decl_line   : 330
    <104c>   DW_AT_decl_column : 17
    <104d>   DW_AT_type        : <0xe9f>
    <1051>   DW_AT_data_member_location: 4
 <2><1052>: Abbrev Number: 0
 <1><1053>: Abbrev Number: 20 (DW_TAG_typedef)
    <1054>   DW_AT_name        : (indirect string, offset: 0x8fdd3): PWR_TypeDef
    <1058>   DW_AT_decl_file   : 7
    <1059>   DW_AT_decl_line   : 331
    <105b>   DW_AT_decl_column : 3
    <105c>   DW_AT_type        : <0x102d>
 <1><1060>: Abbrev Number: 17 (DW_TAG_structure_type)
    <1061>   DW_AT_byte_size   : 144
    <1062>   DW_AT_decl_file   : 7
    <1063>   DW_AT_decl_line   : 337
    <1065>   DW_AT_decl_column : 9
    <1066>   DW_AT_sibling     : <0x122a>
 <2><106a>: Abbrev Number: 19 (DW_TAG_member)
    <106b>   DW_AT_name        : CR
    <106e>   DW_AT_decl_file   : 7
    <106f>   DW_AT_decl_line   : 339
    <1071>   DW_AT_decl_column : 17
    <1072>   DW_AT_type        : <0xe9f>
    <1076>   DW_AT_data_member_location: 0
 <2><1077>: Abbrev Number: 18 (DW_TAG_member)
    <1078>   DW_AT_name        : (indirect string, offset: 0x8fc6e): PLLCFGR
    <107c>   DW_AT_decl_file   : 7
    <107d>   DW_AT_decl_line   : 340
    <107f>   DW_AT_decl_column : 17
    <1080>   DW_AT_type        : <0xe9f>
    <1084>   DW_AT_data_member_location: 4
 <2><1085>: Abbrev Number: 18 (DW_TAG_member)
    <1086>   DW_AT_name        : (indirect string, offset: 0x8e07b): CFGR
    <108a>   DW_AT_decl_file   : 7
    <108b>   DW_AT_decl_line   : 341
    <108d>   DW_AT_decl_column : 17
    <108e>   DW_AT_type        : <0xe9f>
    <1092>   DW_AT_data_member_location: 8
 <2><1093>: Abbrev Number: 19 (DW_TAG_member)
    <1094>   DW_AT_name        : CIR
    <1098>   DW_AT_decl_file   : 7
    <1099>   DW_AT_decl_line   : 342
    <109b>   DW_AT_decl_column : 17
    <109c>   DW_AT_type        : <0xe9f>
    <10a0>   DW_AT_data_member_location: 12
 <2><10a1>: Abbrev Number: 18 (DW_TAG_member)
    <10a2>   DW_AT_name        : (indirect string, offset: 0x90674): AHB1RSTR
    <10a6>   DW_AT_decl_file   : 7
    <10a7>   DW_AT_decl_line   : 343
    <10a9>   DW_AT_decl_column : 17
    <10aa>   DW_AT_type        : <0xe9f>
    <10ae>   DW_AT_data_member_location: 16
 <2><10af>: Abbrev Number: 18 (DW_TAG_member)
    <10b0>   DW_AT_name        : (indirect string, offset: 0x8c1fa): AHB2RSTR
    <10b4>   DW_AT_decl_file   : 7
    <10b5>   DW_AT_decl_line   : 344
    <10b7>   DW_AT_decl_column : 17
    <10b8>   DW_AT_type        : <0xe9f>
    <10bc>   DW_AT_data_member_location: 20
 <2><10bd>: Abbrev Number: 18 (DW_TAG_member)
    <10be>   DW_AT_name        : (indirect string, offset: 0x8e06f): AHB3RSTR
    <10c2>   DW_AT_decl_file   : 7
    <10c3>   DW_AT_decl_line   : 345
    <10c5>   DW_AT_decl_column : 17
    <10c6>   DW_AT_type        : <0xe9f>
    <10ca>   DW_AT_data_member_location: 24
 <2><10cb>: Abbrev Number: 18 (DW_TAG_member)
    <10cc>   DW_AT_name        : (indirect string, offset: 0x916e7): RESERVED0
    <10d0>   DW_AT_decl_file   : 7
    <10d1>   DW_AT_decl_line   : 346
    <10d3>   DW_AT_decl_column : 17
    <10d4>   DW_AT_type        : <0xe93>
    <10d8>   DW_AT_data_member_location: 28
 <2><10d9>: Abbrev Number: 18 (DW_TAG_member)
    <10da>   DW_AT_name        : (indirect string, offset: 0x8c1df): APB1RSTR
    <10de>   DW_AT_decl_file   : 7
    <10df>   DW_AT_decl_line   : 347
    <10e1>   DW_AT_decl_column : 17
    <10e2>   DW_AT_type        : <0xe9f>
    <10e6>   DW_AT_data_member_location: 32
 <2><10e7>: Abbrev Number: 18 (DW_TAG_member)
    <10e8>   DW_AT_name        : (indirect string, offset: 0x8e03f): APB2RSTR
    <10ec>   DW_AT_decl_file   : 7
    <10ed>   DW_AT_decl_line   : 348
    <10ef>   DW_AT_decl_column : 17
    <10f0>   DW_AT_type        : <0xe9f>
    <10f4>   DW_AT_data_member_location: 36
 <2><10f5>: Abbrev Number: 18 (DW_TAG_member)
    <10f6>   DW_AT_name        : (indirect string, offset: 0x916f1): RESERVED1
    <10fa>   DW_AT_decl_file   : 7
    <10fb>   DW_AT_decl_line   : 349
    <10fd>   DW_AT_decl_column : 17
    <10fe>   DW_AT_type        : <0xeb4>
    <1102>   DW_AT_data_member_location: 40
 <2><1103>: Abbrev Number: 18 (DW_TAG_member)
    <1104>   DW_AT_name        : (indirect string, offset: 0x8c044): AHB1ENR
    <1108>   DW_AT_decl_file   : 7
    <1109>   DW_AT_decl_line   : 350
    <110b>   DW_AT_decl_column : 17
    <110c>   DW_AT_type        : <0xe9f>
    <1110>   DW_AT_data_member_location: 48
 <2><1111>: Abbrev Number: 18 (DW_TAG_member)
    <1112>   DW_AT_name        : (indirect string, offset: 0x8d138): AHB2ENR
    <1116>   DW_AT_decl_file   : 7
    <1117>   DW_AT_decl_line   : 351
    <1119>   DW_AT_decl_column : 17
    <111a>   DW_AT_type        : <0xe9f>
    <111e>   DW_AT_data_member_location: 52
 <2><111f>: Abbrev Number: 18 (DW_TAG_member)
    <1120>   DW_AT_name        : (indirect string, offset: 0x8e142): AHB3ENR
    <1124>   DW_AT_decl_file   : 7
    <1125>   DW_AT_decl_line   : 352
    <1127>   DW_AT_decl_column : 17
    <1128>   DW_AT_type        : <0xe9f>
    <112c>   DW_AT_data_member_location: 56
 <2><112d>: Abbrev Number: 18 (DW_TAG_member)
    <112e>   DW_AT_name        : (indirect string, offset: 0x916fb): RESERVED2
    <1132>   DW_AT_decl_file   : 7
    <1133>   DW_AT_decl_line   : 353
    <1135>   DW_AT_decl_column : 17
    <1136>   DW_AT_type        : <0xe93>
    <113a>   DW_AT_data_member_location: 60
 <2><113b>: Abbrev Number: 18 (DW_TAG_member)
    <113c>   DW_AT_name        : (indirect string, offset: 0x8ff55): APB1ENR
    <1140>   DW_AT_decl_file   : 7
    <1141>   DW_AT_decl_line   : 354
    <1143>   DW_AT_decl_column : 17
    <1144>   DW_AT_type        : <0xe9f>
    <1148>   DW_AT_data_member_location: 64
 <2><1149>: Abbrev Number: 18 (DW_TAG_member)
    <114a>   DW_AT_name        : (indirect string, offset: 0x8c294): APB2ENR
    <114e>   DW_AT_decl_file   : 7
    <114f>   DW_AT_decl_line   : 355
    <1151>   DW_AT_decl_column : 17
    <1152>   DW_AT_type        : <0xe9f>
    <1156>   DW_AT_data_member_location: 68
 <2><1157>: Abbrev Number: 18 (DW_TAG_member)
    <1158>   DW_AT_name        : (indirect string, offset: 0x91705): RESERVED3
